<?
$this->addExternalCss("https://fonts.googleapis.com/css2?family=Montserrat:wght@300;400;600;700;800&display=swap");
$first = $arResult['managerCounter'];
?>
<script src="https://cdn.ckeditor.com/ckeditor5/29.0.0/classic/translations/ru.js"></script>
<style>
    [x-cloak] { display: none; }
</style>
<div class="bg-gray-1000 app">

    <div class="py-8">
       <?if($arResult['ADMIN']==='Y'){?>
       <div class="rights mb-4">
          <div class="flex">
             <button class="modal-open mx-4 text-blue-1000 border rounded-2xl h-9 w-48 flex justify-center items-center font-semibold active px-1">Права доступа</button>
          </div>
       </div>
       <?}?>
        <div class="mx-3" x-data="{
         activeTab: 0,
         mack:true,
         back:false,
         underwriting:false,
         counter:<?=$arResult['managerCounter']?>,
         testShow:false,
         <?foreach ($arResult['requests']['services'] as $request)echo 'requestServices'.$request['ID'].':false,';?>
         <?foreach ($arResult['requests']['back'] as $request)echo 'requestServices'.$request['ID'].':false,';?>
         <?foreach ($arResult['requests']['mack'] as $request)echo 'requestServices'.$request['ID'].':false,';?>
         <?foreach ($arResult['requests']['underwriting'] as $request)echo 'requestServices'.$request['ID'].':false,';?>
      }">
            <div class="grid grid-cols-5 gap-4">
                <div class="text-gray-1000">Дата создания</div>
                <div class="text-gray-1000">Лизингополучатель</div>
                <div class="text-gray-1000">Менеджер</div>
                <div class="text-gray-1000">Статус</div>
            </div>
            <div class="grid grid-cols-5 gap-4 mt-4">
                <div>
                    <input class="rounded-xl w-72 h-9 px-4 filter-date" type="text" />
                </div>
                <div>
                    <input class="rounded-xl w-72 h-9 px-4 filter-company-name" type="text" />
                </div>
                <div>
                   <div class="flex items-center justify-between overflow-x-scroll rounded-xl w-72 h-9 px-4 manager bg-white"></div>
                </div>
                <div>
                    <select id="status" class="text-blue-1000 rounded-xl w-72 h-9 px-4 filter-status">
                        <option value="">Все</option>
                       <option value="98">Новая</option>
                       <option value="99">На рассмотрении</option>
                       <option value="100">Доработка</option>
                       <option value="101">Завершено</option>
                    </select>
                </div>
                <div class="flex">
                    <div class="mr-4">
                        <button class="bg-color-1000 text-white rounded-xl h-9 w-24 filter-search">Найти</button>
                    </div>
                    <div class="flex ml-4 justify-center items-center clean-filter-data">
                        <span class="text-center cursor-pointer text-gray-1000">
                            Очистить
                        </span>
                    </div>
                </div>
            </div>
            <hr class="my-6 mx-4">
            <div class="flex justify-between">
               <div class="flex justify-center items-center">
                  <div class="mx-4 text-blue-1000 border rounded-2xl h-9 w-72 flex justify-center items-center font-semibold px-1 cursor-pointer" :class="activeTab===0 ? 'active' : ''" @click="activeTab = 0;counter=<?=$arResult['managerCounter']?>">Заполнение сведений менеджером</div>
                  <div class="mx-4 text-blue-1000 border rounded-2xl h-9 w-52 flex justify-center items-center font-semibold px-2 cursor-pointer" :class="activeTab===1 ? 'active' : ''" @click="activeTab = 1;counter=<?=$arResult['servicesCounter']?>">Рассмотрение службами</div>
                  <div class="mx-4 text-blue-1000 border rounded-2xl h-9 w-64 flex justify-center items-center font-semibold px-2 cursor-pointer" :class="activeTab===2 ? 'active' : ''" @click="activeTab = 2;counter=<?=$arResult['mackCounter']?>">Рассмотрение комитетом</div>
               </div>
               <div class="flex justify-center items-center mr-4">
                  <div class="font-semibold text-gray-1000">Всего заявок на рассмотрении: <span x-text="counter"></div>
               </div>
            </div>
            <br>
           <div class="tabs" x-cloak>
              <div x-show="activeTab===0">
                 <table class="content-table">
                    <thead>
                    <tr>
                       <td>
                          Статус заявки
                       </td>
                       <td>
                          Время и дата создания
                       </td>
                       <td>
                          Менеджер
                       </td>
                       <td>
                          Лизингополучатель
                       </td>
                       <td>
                          Предмет лизинга
                       </td>
                       <td>
                          ID лида
                       </td>
                       <td></td>
                       <td></td>
                    </tr>
                    </thead>
                    <tbody>
                    <?
                    foreach ($arResult['requests']['manager'] as $request):?>
                       <tr class="parent-request-container" data-request-id="<?=$request['ID']?>">
                          <td>
                              <?=$request['STATUS']?>
                          </td>
                          <td><?=$request['DATE_CREATE']?></td>
                          <td><?=$request['MANAGER']?></td>
                          <td><?=$request['LISING_OWNER']?></td>
                          <td class="max-w-xs"><?=$request['LISING_GOAL']?></td>
                          <td><a href="/crm/lead/details/<?=$request['LEAD_ID']?>/"><?=$request['LEAD_ID']?></a></td>
                          <td>
                             <button class="<?=$request['IL_SAVED']?'fill-list-saved':'fill-list'?> py-2 px-2 fill-list-button" data-id="<?=$request['ID']?>">
                                Заполнить
                             </button>
                          </td>
                          <td>
                             <div class="cursor-pointer">
                                <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                             </div>
                          </td>
                       </tr>
                    <?endforeach;?>
                    <?if(count($arResult['requests']['manager']) === 0 ){?>
                       <td colspan="8" class="text-center">Заявок нет</td>
                    <?}?>
                    </tbody>
                 </table>
              </div>
              <div x-show="activeTab===1">
                 <div class="grid grid-cols-8">
                    <div class="text-gray-1000">Статус заявки</div>
                    <div class="text-gray-1000">Время и дата создания</div>
                    <div class="text-gray-1000">Менеджер</div>
                    <div class="text-gray-1000">Лизингополучатель</div>
                    <div class="text-gray-1000">Предмет лизинга</div>
                    <div class="text-gray-1000">ИЛ от менеджера</div>
                    <div class="text-gray-1000">Ссылка</div>
                    <div></div>
                 </div>
                  <?foreach ($arResult['requests']['services'] as $request):?>
                     <div class="parent-request-container" data-request-id="<?=$request['ID']?>">
                        <div class="grid grid-cols-8 mt-4 bg-white info-row items-center <?if($request['FUCKUP']){?>request-fuckup<?}?>" :class="requestServices<?=$request['ID']?>?'accordeon-active':''">
                           <div class="flex items-center" data-requestId="<?=$request['ID']?>">
                              <div class="pl-0 h-9 mr-4 rounded-my w-1 bg-color-red-1000"></div>
                               <?=$request['STATUS']?>
                           </div>
                           <div class="flex items-center"><?=$request['DATE_CREATE']?></div>
                           <div class="flex items-center"><?=$request['MANAGER']?></div>
                           <div class="flex items-center"><?=$request['LISING_OWNER']?></div>
                           <div class="flex items-center mr-4"><?=$request['LISING_GOAL']?></div>
                           <div class="flex items-center justify-center">
                              <button class="w-8 h-8 shadow-my flex justify-center items-center rounded" data-id="<?=$request['ID']?>" onclick="managerListPopup(this)">
                                 <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.53596 10.5265C6.5969 10.5875 6.66925 10.6358 6.74887 10.6688C6.82849 10.7018 6.91383 10.7187 7.00001 10.7187C7.08619 10.7187 7.17153 10.7018 7.25116 10.6688C7.33078 10.6358 7.40312 10.5875 7.46406 10.5265L9.93892 8.05167C10.062 7.9286 10.1311 7.76168 10.1311 7.58763C10.1311 7.41358 10.062 7.24666 9.93892 7.12359C9.81585 7.00052 9.64893 6.93138 9.47488 6.93138C9.30083 6.93138 9.13391 7.00052 9.01084 7.12359L7.65626 8.47818V1.3125C7.65626 1.13845 7.58712 0.971532 7.46405 0.848461C7.34098 0.72539 7.17406 0.65625 7.00001 0.65625C6.82596 0.65625 6.65904 0.72539 6.53597 0.848461C6.4129 0.971532 6.34376 1.13845 6.34376 1.3125V8.47818L4.98918 7.12359C4.86611 7.00052 4.69919 6.93138 4.52514 6.93138C4.3511 6.93138 4.18418 7.00052 4.06111 7.12359C3.93804 7.24666 3.8689 7.41358 3.8689 7.58763C3.8689 7.76168 3.93804 7.9286 4.06111 8.05167L6.53596 10.5265Z" fill="#28315F"/>
                                    <path d="M12.6875 6.34375C12.5135 6.34375 12.3465 6.41289 12.2235 6.53596C12.1004 6.65903 12.0312 6.82595 12.0312 7V12.0312H1.96875V7C1.96875 6.82595 1.89961 6.65903 1.77654 6.53596C1.65347 6.41289 1.48655 6.34375 1.3125 6.34375C1.13845 6.34375 0.971532 6.41289 0.848461 6.53596C0.72539 6.65903 0.65625 6.82595 0.65625 7V12.25C0.65625 12.5401 0.771484 12.8183 0.976602 13.0234C1.18172 13.2285 1.45992 13.3438 1.75 13.3438H12.25C12.5401 13.3438 12.8183 13.2285 13.0234 13.0234C13.2285 12.8183 13.3438 12.5401 13.3438 12.25V7C13.3438 6.82595 13.2746 6.65903 13.1515 6.53596C13.0285 6.41289 12.8615 6.34375 12.6875 6.34375Z" fill="#28315F"/>
                                 </svg>
                              </button>
                           </div>
                           <div class="flex items-center">
                              <button class="w-8 h-8 shadow-my flex justify-center items-center rounded" onclick="copyToClipboard('<?=$request['LINK']?>')">
                                 <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.46001 4.56631V4.61631H5.51001H6.49345H6.54345V4.56631V2.03777C6.54345 2.01362 6.56318 1.99388 6.58733 1.99388H14.9227C14.9468 1.99388 14.9666 2.01362 14.9666 2.03777V10.3731C14.9666 10.3973 14.9468 10.417 14.9227 10.417H12.473H12.423V10.467V11.4505V11.5005H12.473H14.9227C15.5443 11.5005 16.05 10.9948 16.05 10.3731V2.03777C16.05 1.41613 15.5443 0.910449 14.9227 0.910449H6.58733C5.96565 0.910449 5.46001 1.41613 5.46001 2.03777V4.56631Z" fill="#28315F" stroke="#28315F" stroke-width="0.1"/>
                                    <path d="M10.4561 14.9625V14.9642C10.4552 14.9876 10.4358 15.0064 10.4122 15.0064H2.07687C2.05267 15.0064 2.03295 14.9867 2.03295 14.9625V6.62716C2.03295 6.60298 2.05269 6.58324 2.07687 6.58324H10.4122C10.4364 6.58324 10.4561 6.60298 10.4561 6.62716V14.9625ZM10.4122 5.4998H2.07687C1.45519 5.4998 0.949512 6.00548 0.949512 6.62716V14.9625C0.949546 15.5842 1.45519 16.0898 2.07687 16.0898H10.4122C11.0339 16.0898 11.5396 15.5842 11.5396 14.9625V6.62716C11.5396 6.00548 11.0338 5.4998 10.4122 5.4998Z" fill="#28315F" stroke="#28315F" stroke-width="0.1"/>
                                 </svg>
                              </button>
                           </div>
                           <div class="flex items-center">
                              <div class="cursor-pointer" @click="requestServices<?=$request['ID']?>=!requestServices<?=$request['ID']?>">
                                 <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                 <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                 <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                              </div>
                           </div>
                        </div>

                        <div class="w-full bg-white py-4 <?=$request['FUCKUP']?'-mt-4':''?> accordeon-row px-4 border-t border-gray-1000" x-show="requestServices<?=$request['ID']?>">
                           <div class="w-full block mb-4">
                              <div class="grid grid-cols-4 w-full">
                                 <div class="text-gray-1000">Согласующий</div>
                                 <div class="text-gray-1000">Статус рассмотрения</div>
                                 <div class="text-gray-1000">Заключение</div>
                                 <div class="text-gray-1000">Дата и время принятия решения</div>
                              </div>
                           </div>
                           <!-- sb block -->
                           <div class="my-2">
                              <div class="grid grid-cols-4 w-full">
                                 <!-- аватар -->
                                 <div>
                                    <div class="flex justify-start items-center">
                                       <div class="pr-2">
                                          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                             <circle cx="16" cy="16" r="16" fill="#28315F"/>
                                             <g clip-path="url(#clip0)">
                                                <path d="M15.8975 15.7366C16.8504 15.7366 17.6756 15.3948 18.3498 14.7204C19.0241 14.0462 19.3658 13.2213 19.3658 12.2682C19.3658 11.3155 19.0241 10.4904 18.3497 9.81595C17.6754 9.14183 16.8503 8.80005 15.8975 8.80005C14.9444 8.80005 14.1194 9.14183 13.4452 9.81606C12.771 10.4903 12.4291 11.3154 12.4291 12.2682C12.4291 13.2213 12.771 14.0463 13.4453 14.7206C14.1197 15.3947 14.9447 15.7366 15.8975 15.7366Z" fill="white"/>
                                                <path d="M21.9662 19.8728C21.9468 19.5923 21.9074 19.2862 21.8495 18.963C21.7911 18.6373 21.7158 18.3295 21.6257 18.0481C21.5327 17.7573 21.4061 17.4701 21.2497 17.1949C21.0873 16.9093 20.8966 16.6606 20.6826 16.4559C20.4588 16.2418 20.1848 16.0696 19.8679 15.944C19.5522 15.8191 19.2023 15.7558 18.828 15.7558C18.681 15.7558 18.5388 15.8162 18.2642 15.9949C18.0953 16.1051 17.8976 16.2325 17.677 16.3735C17.4884 16.4937 17.2328 16.6063 16.9172 16.7082C16.6093 16.8079 16.2966 16.8584 15.988 16.8584C15.6794 16.8584 15.3668 16.8079 15.0585 16.7082C14.7432 16.6064 14.4877 16.4938 14.2993 16.3736C14.0808 16.234 13.883 16.1065 13.7115 15.9948C13.4373 15.8161 13.295 15.7557 13.148 15.7557C12.7736 15.7557 12.4238 15.8191 12.1082 15.9442C11.7915 16.0695 11.5174 16.2417 11.2934 16.456C11.0795 16.6608 10.8887 16.9094 10.7265 17.1949C10.5702 17.4701 10.4436 17.7572 10.3505 18.0482C10.2605 18.3296 10.1852 18.6373 10.1268 18.963C10.0689 19.2857 10.0296 19.5919 10.0101 19.8732C9.99099 20.1487 9.98132 20.4347 9.98132 20.7235C9.98132 21.4752 10.2203 22.0837 10.6915 22.5325C11.1569 22.9754 11.7726 23.2 12.5215 23.2H19.4552C20.204 23.2 20.8196 22.9755 21.285 22.5325C21.7564 22.0841 21.9953 21.4754 21.9953 20.7234C21.9952 20.4333 21.9854 20.1471 21.9662 19.8728Z" fill="white"/>
                                             </g>
                                             <defs>
                                                <clipPath id="clip0">
                                                   <rect width="14.4" height="14.4" fill="white" transform="translate(8.80005 8.80005)"/>
                                                </clipPath>
                                             </defs>
                                          </svg>
                                       </div>
                                       <div class="px-2 text-gray-1000 sb-responsible" data-id="<?=$request['ID']?>">
                                           <?=(!$request['SB_RESPONSIBLE'])?'-':$request['SB_RESPONSIBLE']['LAST_NAME'] . ' ' . substr($request['SB_RESPONSIBLE']['NAME'],0,2) . '.' . substr($request['SB_RESPONSIBLE']['SECOND_NAME'],0,2) . '.' ;?>
                                       </div>
                                    </div>
                                 </div>
                                 <!--аватар -->
                                 <!--статус согласования-->
                                 <div class="cursor-pointer">
                                     <?=($request['SB'] === NULL)?'<svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                           <rect x="0.5" y="0.5" width="36" height="29" rx="5.5" fill="white" stroke="#D9DCEA"/>
                                           <path d="M18.0696 8.41028C18.9201 8.43318 19.728 8.59019 20.4575 9.04814C21.9 9.95424 22.4169 11.7664 21.6383 13.2123C21.3243 13.7978 20.85 14.2492 20.3692 14.6973C20.0519 14.995 19.7346 15.2927 19.4173 15.5936C18.9986 15.996 18.8186 16.503 18.7696 17.0689C18.7598 17.1997 18.75 17.3306 18.7369 17.4581C18.714 17.6904 18.5373 17.8539 18.3018 17.8638C18.1154 17.8703 17.9322 17.8703 17.7457 17.867C17.4611 17.8638 17.2714 17.6806 17.2681 17.396C17.2616 16.3427 17.5691 15.4104 18.3411 14.6646C18.7761 14.2426 19.2243 13.8403 19.6626 13.4216C19.9668 13.1305 20.2448 12.8164 20.3692 12.3977C20.6047 11.6061 20.2906 10.7524 19.5906 10.1734C18.5962 9.34908 16.4536 9.36544 15.8256 11.3445C15.8027 11.4131 15.7831 11.4786 15.7602 11.544C15.613 11.9463 15.1877 12.159 14.7821 12.0314C14.383 11.9071 14.1475 11.4753 14.2718 11.0664C14.7069 9.63694 15.6522 8.7701 17.1308 8.50514C17.4382 8.45607 17.7555 8.44299 18.0696 8.41028Z" fill="#28315F"/>
                                           <path d="M17.1929 20.0357C17.1929 19.5582 17.5756 19.1722 18.0532 19.1754C18.5209 19.1787 18.9037 19.5647 18.9037 20.0292C18.9037 20.5068 18.5177 20.8895 18.0401 20.8895C17.569 20.8895 17.1929 20.51 17.1929 20.0357Z" fill="#28315F"/>
                                        </svg>':'<svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                           <rect width="37" height="30" rx="6" fill="#91B23B"/>
                                           <path d="M24.1395 19.1181C24.1395 19.0978 24.1363 19.0785 24.1336 19.0589V14.5025H24.1335L24.1336 14.5009C24.1336 14.4446 24.1225 14.3888 24.1009 14.3367C24.0794 14.2846 24.0477 14.2373 24.0079 14.1974C23.968 14.1576 23.9207 14.126 23.8686 14.1044C23.8165 14.0828 23.7607 14.0718 23.7043 14.0718C23.6963 14.0718 23.6891 14.0736 23.6813 14.0741H22.8691V14.0772C22.7581 14.0803 22.6526 14.1263 22.5749 14.2057C22.4972 14.285 22.4534 14.3914 22.4526 14.5025H22.4513V19.1567H22.4586C22.4682 19.2601 22.5152 19.3564 22.5908 19.4277C22.6664 19.4989 22.7653 19.5402 22.8691 19.5437V19.5474H23.7104C23.9473 19.5474 24.1395 19.3552 24.1395 19.1181Z" fill="white"/>
                                           <path d="M21.6014 19.8323V13.6566L21.6016 13.6551C21.6016 13.5987 21.5905 13.5429 21.5689 13.4908C21.5473 13.4387 21.5157 13.3914 21.4758 13.3515C21.4359 13.3117 21.3886 13.2801 21.3365 13.2585C21.2844 13.2369 21.2286 13.2259 21.1722 13.2259C21.1644 13.2259 21.157 13.2277 21.1492 13.2283H19.4684C19.4434 13.1882 19.4129 13.1519 19.3777 13.1205L17.7057 10.2241L17.7015 10.2266C17.5339 9.92994 17.2195 9.72974 16.8587 9.72974C16.3221 9.72974 15.887 10.1711 15.887 10.7155H15.8771V13.2281H13.5614V13.2311C13.4504 13.2342 13.3449 13.2803 13.2672 13.3596C13.1895 13.4389 13.1457 13.5454 13.1449 13.6564H13.1436V18.4206H13.1446C13.1446 18.4753 13.1656 18.5299 13.2068 18.5719L13.2063 18.5724L14.8587 20.2248L14.8628 20.2207C14.9103 20.2598 14.9687 20.2745 15.0264 20.2668H21.1362C21.1485 20.2678 21.1604 20.2705 21.1729 20.2705C21.2827 20.2703 21.3882 20.228 21.4677 20.1522C21.5471 20.0765 21.5944 19.9731 21.5999 19.8635H21.6012V19.8503C21.6012 19.8472 21.6021 19.8444 21.6021 19.8413C21.6021 19.8383 21.6016 19.8354 21.6014 19.8323ZM13.6501 18.4206L13.6572 18.4286L13.6492 18.4206H13.6501Z" fill="white"/>
                                        </svg>'?>
                                 </div>
                                 <!--статус согласования-->
                                 <!--заключение-->
                                 <div class="text-gray-1000 flex items-center">
                                    <? if($arResult['userPermissions']['66']['edit'] !== 'N'){?><button class="py-2 px-2 text-blue-1000 font-semibold default-button <?=(!$request['SB_RESPONSIBLE'])?'edit-sb-disabled':'edit-sb';?>" data-id="<?=$request['ID']?>"><?=(!$request['SB_RESPONSIBLE'])?'Заполнить':'Приступить';?></button><?}
                                    else{?><button class="py-2 px-2 text-blue-1000 font-semibold default-button show-conclusion" data-id="<?=$request['ID']?>" data-service="security">Просмотр</button><?}?>
                                 </div>
                                 <!--заключение-->
                                 <!--время принятия решения-->
                                 <div class="text-gray-1000 flex items-center">
                                     <?=($request['SB_CREATE_TIME'])?date('d.m.Y H:i:s',$request['SB_CREATE_TIME']):'-'?>
                                 </div>
                                 <!--время принятия решения-->
                              </div>
                           </div>
                           <!-- sb block -->
                           <hr class="my-4">
                           <!-- legal block -->
                           <div class="my-2">
                              <div class="grid grid-cols-4 w-full">
                                 <!-- аватар -->
                                 <div>
                                    <div class="flex justify-start items-center">
                                       <div class="pr-2">
                                          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                             <circle cx="16" cy="16" r="16" fill="#28315F"/>
                                             <g clip-path="url(#clip0)">
                                                <path d="M15.8975 15.7366C16.8504 15.7366 17.6756 15.3948 18.3498 14.7204C19.0241 14.0462 19.3658 13.2213 19.3658 12.2682C19.3658 11.3155 19.0241 10.4904 18.3497 9.81595C17.6754 9.14183 16.8503 8.80005 15.8975 8.80005C14.9444 8.80005 14.1194 9.14183 13.4452 9.81606C12.771 10.4903 12.4291 11.3154 12.4291 12.2682C12.4291 13.2213 12.771 14.0463 13.4453 14.7206C14.1197 15.3947 14.9447 15.7366 15.8975 15.7366Z" fill="white"/>
                                                <path d="M21.9662 19.8728C21.9468 19.5923 21.9074 19.2862 21.8495 18.963C21.7911 18.6373 21.7158 18.3295 21.6257 18.0481C21.5327 17.7573 21.4061 17.4701 21.2497 17.1949C21.0873 16.9093 20.8966 16.6606 20.6826 16.4559C20.4588 16.2418 20.1848 16.0696 19.8679 15.944C19.5522 15.8191 19.2023 15.7558 18.828 15.7558C18.681 15.7558 18.5388 15.8162 18.2642 15.9949C18.0953 16.1051 17.8976 16.2325 17.677 16.3735C17.4884 16.4937 17.2328 16.6063 16.9172 16.7082C16.6093 16.8079 16.2966 16.8584 15.988 16.8584C15.6794 16.8584 15.3668 16.8079 15.0585 16.7082C14.7432 16.6064 14.4877 16.4938 14.2993 16.3736C14.0808 16.234 13.883 16.1065 13.7115 15.9948C13.4373 15.8161 13.295 15.7557 13.148 15.7557C12.7736 15.7557 12.4238 15.8191 12.1082 15.9442C11.7915 16.0695 11.5174 16.2417 11.2934 16.456C11.0795 16.6608 10.8887 16.9094 10.7265 17.1949C10.5702 17.4701 10.4436 17.7572 10.3505 18.0482C10.2605 18.3296 10.1852 18.6373 10.1268 18.963C10.0689 19.2857 10.0296 19.5919 10.0101 19.8732C9.99099 20.1487 9.98132 20.4347 9.98132 20.7235C9.98132 21.4752 10.2203 22.0837 10.6915 22.5325C11.1569 22.9754 11.7726 23.2 12.5215 23.2H19.4552C20.204 23.2 20.8196 22.9755 21.285 22.5325C21.7564 22.0841 21.9953 21.4754 21.9953 20.7234C21.9952 20.4333 21.9854 20.1471 21.9662 19.8728Z" fill="white"/>
                                             </g>
                                             <defs>
                                                <clipPath id="clip0">
                                                   <rect width="14.4" height="14.4" fill="white" transform="translate(8.80005 8.80005)"/>
                                                </clipPath>
                                             </defs>
                                          </svg>
                                       </div>
                                       <div class="px-2 text-gray-1000 legal-responsible" data-id="<?=$request['ID']?>">
                                          <?=(!$request['LEGAL_RESPONSIBLE'])?'-':$request['LEGAL_RESPONSIBLE']['LAST_NAME'] . ' ' . substr($request['LEGAL_RESPONSIBLE']['NAME'],0,2) . '.' . substr($request['LEGAL_RESPONSIBLE']['SECOND_NAME'],0,2) . '.' ;?>
                                       </div>
                                    </div>
                                 </div>
                                 <!-- аватар -->
                                 <!--статус согласования-->
                                 <div class="cursor-pointer">
                                     <?=($request['LEGAL'] === NULL)?'<svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                           <rect x="0.5" y="0.5" width="36" height="29" rx="5.5" fill="white" stroke="#D9DCEA"/>
                                           <path d="M18.0696 8.41028C18.9201 8.43318 19.728 8.59019 20.4575 9.04814C21.9 9.95424 22.4169 11.7664 21.6383 13.2123C21.3243 13.7978 20.85 14.2492 20.3692 14.6973C20.0519 14.995 19.7346 15.2927 19.4173 15.5936C18.9986 15.996 18.8186 16.503 18.7696 17.0689C18.7598 17.1997 18.75 17.3306 18.7369 17.4581C18.714 17.6904 18.5373 17.8539 18.3018 17.8638C18.1154 17.8703 17.9322 17.8703 17.7457 17.867C17.4611 17.8638 17.2714 17.6806 17.2681 17.396C17.2616 16.3427 17.5691 15.4104 18.3411 14.6646C18.7761 14.2426 19.2243 13.8403 19.6626 13.4216C19.9668 13.1305 20.2448 12.8164 20.3692 12.3977C20.6047 11.6061 20.2906 10.7524 19.5906 10.1734C18.5962 9.34908 16.4536 9.36544 15.8256 11.3445C15.8027 11.4131 15.7831 11.4786 15.7602 11.544C15.613 11.9463 15.1877 12.159 14.7821 12.0314C14.383 11.9071 14.1475 11.4753 14.2718 11.0664C14.7069 9.63694 15.6522 8.7701 17.1308 8.50514C17.4382 8.45607 17.7555 8.44299 18.0696 8.41028Z" fill="#28315F"/>
                                           <path d="M17.1929 20.0357C17.1929 19.5582 17.5756 19.1722 18.0532 19.1754C18.5209 19.1787 18.9037 19.5647 18.9037 20.0292C18.9037 20.5068 18.5177 20.8895 18.0401 20.8895C17.569 20.8895 17.1929 20.51 17.1929 20.0357Z" fill="#28315F"/>
                                        </svg>':'<svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                           <rect width="37" height="30" rx="6" fill="#91B23B"/>
                                           <path d="M24.1395 19.1181C24.1395 19.0978 24.1363 19.0785 24.1336 19.0589V14.5025H24.1335L24.1336 14.5009C24.1336 14.4446 24.1225 14.3888 24.1009 14.3367C24.0794 14.2846 24.0477 14.2373 24.0079 14.1974C23.968 14.1576 23.9207 14.126 23.8686 14.1044C23.8165 14.0828 23.7607 14.0718 23.7043 14.0718C23.6963 14.0718 23.6891 14.0736 23.6813 14.0741H22.8691V14.0772C22.7581 14.0803 22.6526 14.1263 22.5749 14.2057C22.4972 14.285 22.4534 14.3914 22.4526 14.5025H22.4513V19.1567H22.4586C22.4682 19.2601 22.5152 19.3564 22.5908 19.4277C22.6664 19.4989 22.7653 19.5402 22.8691 19.5437V19.5474H23.7104C23.9473 19.5474 24.1395 19.3552 24.1395 19.1181Z" fill="white"/>
                                           <path d="M21.6014 19.8323V13.6566L21.6016 13.6551C21.6016 13.5987 21.5905 13.5429 21.5689 13.4908C21.5473 13.4387 21.5157 13.3914 21.4758 13.3515C21.4359 13.3117 21.3886 13.2801 21.3365 13.2585C21.2844 13.2369 21.2286 13.2259 21.1722 13.2259C21.1644 13.2259 21.157 13.2277 21.1492 13.2283H19.4684C19.4434 13.1882 19.4129 13.1519 19.3777 13.1205L17.7057 10.2241L17.7015 10.2266C17.5339 9.92994 17.2195 9.72974 16.8587 9.72974C16.3221 9.72974 15.887 10.1711 15.887 10.7155H15.8771V13.2281H13.5614V13.2311C13.4504 13.2342 13.3449 13.2803 13.2672 13.3596C13.1895 13.4389 13.1457 13.5454 13.1449 13.6564H13.1436V18.4206H13.1446C13.1446 18.4753 13.1656 18.5299 13.2068 18.5719L13.2063 18.5724L14.8587 20.2248L14.8628 20.2207C14.9103 20.2598 14.9687 20.2745 15.0264 20.2668H21.1362C21.1485 20.2678 21.1604 20.2705 21.1729 20.2705C21.2827 20.2703 21.3882 20.228 21.4677 20.1522C21.5471 20.0765 21.5944 19.9731 21.5999 19.8635H21.6012V19.8503C21.6012 19.8472 21.6021 19.8444 21.6021 19.8413C21.6021 19.8383 21.6016 19.8354 21.6014 19.8323ZM13.6501 18.4206L13.6572 18.4286L13.6492 18.4206H13.6501Z" fill="white"/>
                                        </svg>'?>
                                 </div>
                                 <!--статус согласования-->
                                 <!--заключение-->
                                 <div class="text-gray-1000 flex items-center">
                                     <?if($arResult['userPermissions']['67']['edit'] !== 'N' && $request['LEGAL'] === NULL){?><button class="py-2 px-2 text-blue-1000 font-semibold default-button <?=(!$request['LEGAL_RESPONSIBLE'])?'edit-legal-disabled':'edit-legal';?>" data-id="<?=$request['ID']?>" data-action="<?=$request['LEGAL_ID']>0?'save':'create'?>"><?=(!$request['LEGAL_RESPONSIBLE'])?'Заполнить':'Приступить';?></button><?}
                                     else{?><button class="py-2 px-2 text-blue-1000 font-semibold default-button show-conclusion" data-id="<?=$request['ID']?>" data-service="legal">Просмотр</button><?}?>
                                 </div>
                                 <!--заключение-->
                                 <!--время принятия решения-->
                                 <div class="text-gray-1000 flex items-center">
                                     <?=($request['LEGAL_CREATE_TIME'])?date('d.m.Y H:i:s',$request['LEGAL_CREATE_TIME']):'-'?>
                                 </div>
                                 <!--время принятия решения-->
                              </div>
                           </div>
                           <!-- legal block -->
                           <hr class="my-4">
                           <!-- finance block -->
                           <div class="my-2">
                              <div class="grid grid-cols-4 w-full">
                                 <!-- аватар -->
                                 <div>
                                    <div class="flex justify-start items-center">
                                       <div class="pr-2">
                                          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                             <circle cx="16" cy="16" r="16" fill="#28315F"/>
                                             <g clip-path="url(#clip0)">
                                                <path d="M15.8975 15.7366C16.8504 15.7366 17.6756 15.3948 18.3498 14.7204C19.0241 14.0462 19.3658 13.2213 19.3658 12.2682C19.3658 11.3155 19.0241 10.4904 18.3497 9.81595C17.6754 9.14183 16.8503 8.80005 15.8975 8.80005C14.9444 8.80005 14.1194 9.14183 13.4452 9.81606C12.771 10.4903 12.4291 11.3154 12.4291 12.2682C12.4291 13.2213 12.771 14.0463 13.4453 14.7206C14.1197 15.3947 14.9447 15.7366 15.8975 15.7366Z" fill="white"/>
                                                <path d="M21.9662 19.8728C21.9468 19.5923 21.9074 19.2862 21.8495 18.963C21.7911 18.6373 21.7158 18.3295 21.6257 18.0481C21.5327 17.7573 21.4061 17.4701 21.2497 17.1949C21.0873 16.9093 20.8966 16.6606 20.6826 16.4559C20.4588 16.2418 20.1848 16.0696 19.8679 15.944C19.5522 15.8191 19.2023 15.7558 18.828 15.7558C18.681 15.7558 18.5388 15.8162 18.2642 15.9949C18.0953 16.1051 17.8976 16.2325 17.677 16.3735C17.4884 16.4937 17.2328 16.6063 16.9172 16.7082C16.6093 16.8079 16.2966 16.8584 15.988 16.8584C15.6794 16.8584 15.3668 16.8079 15.0585 16.7082C14.7432 16.6064 14.4877 16.4938 14.2993 16.3736C14.0808 16.234 13.883 16.1065 13.7115 15.9948C13.4373 15.8161 13.295 15.7557 13.148 15.7557C12.7736 15.7557 12.4238 15.8191 12.1082 15.9442C11.7915 16.0695 11.5174 16.2417 11.2934 16.456C11.0795 16.6608 10.8887 16.9094 10.7265 17.1949C10.5702 17.4701 10.4436 17.7572 10.3505 18.0482C10.2605 18.3296 10.1852 18.6373 10.1268 18.963C10.0689 19.2857 10.0296 19.5919 10.0101 19.8732C9.99099 20.1487 9.98132 20.4347 9.98132 20.7235C9.98132 21.4752 10.2203 22.0837 10.6915 22.5325C11.1569 22.9754 11.7726 23.2 12.5215 23.2H19.4552C20.204 23.2 20.8196 22.9755 21.285 22.5325C21.7564 22.0841 21.9953 21.4754 21.9953 20.7234C21.9952 20.4333 21.9854 20.1471 21.9662 19.8728Z" fill="white"/>
                                             </g>
                                             <defs>
                                                <clipPath id="clip0">
                                                   <rect width="14.4" height="14.4" fill="white" transform="translate(8.80005 8.80005)"/>
                                                </clipPath>
                                             </defs>
                                          </svg>
                                       </div>
                                       <div class="px-2 text-gray-1000 finance-responsible" data-id="<?=$request['ID']?>">
                                           <?=(!$request['FINANCE_RESPONSIBLE'])?'-':$request['FINANCE_RESPONSIBLE']['LAST_NAME'] . ' ' . substr($request['FINANCE_RESPONSIBLE']['NAME'],0,2) . '.' . substr($request['FINANCE_RESPONSIBLE']['SECOND_NAME'],0,2) . '.' ;?>
                                       </div>
                                    </div>
                                 </div>
                                 <!-- аватар -->
                                 <!--статус согласования-->
                                 <div class="cursor-pointer">
                                     <?=($request['FINANCE'] === NULL)?'<svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                           <rect x="0.5" y="0.5" width="36" height="29" rx="5.5" fill="white" stroke="#D9DCEA"/>
                                           <path d="M18.0696 8.41028C18.9201 8.43318 19.728 8.59019 20.4575 9.04814C21.9 9.95424 22.4169 11.7664 21.6383 13.2123C21.3243 13.7978 20.85 14.2492 20.3692 14.6973C20.0519 14.995 19.7346 15.2927 19.4173 15.5936C18.9986 15.996 18.8186 16.503 18.7696 17.0689C18.7598 17.1997 18.75 17.3306 18.7369 17.4581C18.714 17.6904 18.5373 17.8539 18.3018 17.8638C18.1154 17.8703 17.9322 17.8703 17.7457 17.867C17.4611 17.8638 17.2714 17.6806 17.2681 17.396C17.2616 16.3427 17.5691 15.4104 18.3411 14.6646C18.7761 14.2426 19.2243 13.8403 19.6626 13.4216C19.9668 13.1305 20.2448 12.8164 20.3692 12.3977C20.6047 11.6061 20.2906 10.7524 19.5906 10.1734C18.5962 9.34908 16.4536 9.36544 15.8256 11.3445C15.8027 11.4131 15.7831 11.4786 15.7602 11.544C15.613 11.9463 15.1877 12.159 14.7821 12.0314C14.383 11.9071 14.1475 11.4753 14.2718 11.0664C14.7069 9.63694 15.6522 8.7701 17.1308 8.50514C17.4382 8.45607 17.7555 8.44299 18.0696 8.41028Z" fill="#28315F"/>
                                           <path d="M17.1929 20.0357C17.1929 19.5582 17.5756 19.1722 18.0532 19.1754C18.5209 19.1787 18.9037 19.5647 18.9037 20.0292C18.9037 20.5068 18.5177 20.8895 18.0401 20.8895C17.569 20.8895 17.1929 20.51 17.1929 20.0357Z" fill="#28315F"/>
                                        </svg>':'<svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                           <rect width="37" height="30" rx="6" fill="#91B23B"/>
                                           <path d="M24.1395 19.1181C24.1395 19.0978 24.1363 19.0785 24.1336 19.0589V14.5025H24.1335L24.1336 14.5009C24.1336 14.4446 24.1225 14.3888 24.1009 14.3367C24.0794 14.2846 24.0477 14.2373 24.0079 14.1974C23.968 14.1576 23.9207 14.126 23.8686 14.1044C23.8165 14.0828 23.7607 14.0718 23.7043 14.0718C23.6963 14.0718 23.6891 14.0736 23.6813 14.0741H22.8691V14.0772C22.7581 14.0803 22.6526 14.1263 22.5749 14.2057C22.4972 14.285 22.4534 14.3914 22.4526 14.5025H22.4513V19.1567H22.4586C22.4682 19.2601 22.5152 19.3564 22.5908 19.4277C22.6664 19.4989 22.7653 19.5402 22.8691 19.5437V19.5474H23.7104C23.9473 19.5474 24.1395 19.3552 24.1395 19.1181Z" fill="white"/>
                                           <path d="M21.6014 19.8323V13.6566L21.6016 13.6551C21.6016 13.5987 21.5905 13.5429 21.5689 13.4908C21.5473 13.4387 21.5157 13.3914 21.4758 13.3515C21.4359 13.3117 21.3886 13.2801 21.3365 13.2585C21.2844 13.2369 21.2286 13.2259 21.1722 13.2259C21.1644 13.2259 21.157 13.2277 21.1492 13.2283H19.4684C19.4434 13.1882 19.4129 13.1519 19.3777 13.1205L17.7057 10.2241L17.7015 10.2266C17.5339 9.92994 17.2195 9.72974 16.8587 9.72974C16.3221 9.72974 15.887 10.1711 15.887 10.7155H15.8771V13.2281H13.5614V13.2311C13.4504 13.2342 13.3449 13.2803 13.2672 13.3596C13.1895 13.4389 13.1457 13.5454 13.1449 13.6564H13.1436V18.4206H13.1446C13.1446 18.4753 13.1656 18.5299 13.2068 18.5719L13.2063 18.5724L14.8587 20.2248L14.8628 20.2207C14.9103 20.2598 14.9687 20.2745 15.0264 20.2668H21.1362C21.1485 20.2678 21.1604 20.2705 21.1729 20.2705C21.2827 20.2703 21.3882 20.228 21.4677 20.1522C21.5471 20.0765 21.5944 19.9731 21.5999 19.8635H21.6012V19.8503C21.6012 19.8472 21.6021 19.8444 21.6021 19.8413C21.6021 19.8383 21.6016 19.8354 21.6014 19.8323ZM13.6501 18.4206L13.6572 18.4286L13.6492 18.4206H13.6501Z" fill="white"/>
                                        </svg>'?>
                                 </div>
                                 <!--статус согласования-->
                                 <!--заключение-->
                                 <div class="text-gray-1000 flex items-center">
                                     <?if($arResult['userPermissions']['68']['edit'] !== 'N'){?><button class="py-2 px-2 text-blue-1000 font-semibold default-button <?=(!$request['FINANCE_RESPONSIBLE'])?'edit-finance-disabled':'edit-finance';?>" data-id="<?=$request['ID']?>"><?=(!$request['FINANCE_RESPONSIBLE'])?'Заполнить':'Приступить';?></button><?}
                                     else{?><button class="py-2 px-2 text-blue-1000 font-semibold default-button show-conclusion" data-id="<?=$request['ID']?>" data-service="finance">Просмотр</button><?}?>
                                 </div>
                                 <!--заключение-->
                                 <!--время принятия решения-->
                                 <div class="text-gray-1000 flex items-center">
                                     <?=($request['FINANCE_CREATE_TIME'])?date('d.m.Y H:i:s',$request['FINANCE_CREATE_TIME']):'-'?>
                                 </div>
                                 <!--время принятия решения-->
                              </div>
                           </div>
                           <!-- finance block -->
                            <!-- блок отправки на комитет start -->
                            <?
                            if($request['SB'] !== NULL && $request['LEGAL'] !== NULL && $request['FINANCE'] !== NULL){?>
                               <hr class="mt-4 mb-8">
                               <div>
                                  <div class="flex justify-between">
                                     <div>
                                        <div class="flex justify-center items-center">
                                           <div class="text-blue-1000 font-semibold">
                                              Итоговый информационный лист:
                                           </div>
                                           <div class="ml-4">
                                              <button class="py-2 px-2 text-blue-1000 font-semibold default-button">Просмотр</button>
                                           </div>
                                        </div>
                                     </div>
                                     <div>
                                        <div class="flex justify-center-items-center">
                                           <div class="text-gray-1000 flex items-center">
                                              Выберите комитет для рассмотрения
                                           </div>
                                           <div class="mx-4 ">
                                              <select class="bg-gray-1000 py-2 px-2 rounded-2xl w-48 text-blue-1000 outline-none commitee" data-id="<?=$request['ID']?>">
                                                 <option value="mack">МЭК</option>
                                                 <option value="back">БЭК</option>
                                                 <option value="underwriting">Андеррайтинг</option>
                                              </select>
                                           </div>
                                           <div class="flex items-center">
                                              <button class="flex items-center py-2 px-2 text-white bg-green-1000 font-semibold rounded-2xl cursor-pointer" onclick="sendToCommitte(this)" data-id="<?=$request['ID']?>">Отправить на комитет</button>
                                           </div>
                                        </div>
                                     </div>
                                  </div>
                               </div>
                            <?}?>
                           <!-- блок отправки на комитет  end -->
                        </div>
                     </div>

                  <?endforeach;?>
                  <?if(count($arResult['requests']['services']) === 0 ){?>
                     <div class="flex justify-center items-center mt-4 bg-white info-row">Заявок нет</div>
                  <?}?>
              </div>
              <div x-show="activeTab===2">
                 <hr class="my-6 mx-4">
                 <div class="flex justify-start items-center mb-4">
                    <div class="mx-4 text-blue-1000 border rounded-2xl h-9 w-40 flex justify-center items-center font-semibold px-1 cursor-pointer" :class="mack ? 'active' : ''" @click="mack = true;underwriting = false;back = false;counter=<?=$arResult['mackCounter']?>">МЭК</div>
                    <div class="mx-4 text-blue-1000 border rounded-2xl h-9 w-40 flex justify-center items-center font-semibold px-2 cursor-pointer" :class="underwriting? 'active' : ''" @click="underwriting = true;mack = false;back = false;counter=<?=$arResult['underwritingCounter']?>">Андеррайтинг</div>
                    <div class="mx-4 text-blue-1000 border rounded-2xl h-9 w-40 flex justify-center items-center font-semibold px-2 cursor-pointer" :class="back ? 'active' : ''" @click="back = true;underwriting = false;mack = false;counter=<?=$arResult['backCounter']?>">БЭК</div>
                 </div>
                 <div x-show="mack">
                    <div class="grid grid-cols-8">
                       <div class="text-gray-1000">Статус заявки</div>
                       <div class="text-gray-1000">Время и дата создания</div>
                       <div class="text-gray-1000">Менеджер</div>
                       <div class="text-gray-1000">Лизингополучатель</div>
                       <div class="text-gray-1000">Предмет лизинга</div>
                       <div class="text-gray-1000">Итоговый ИЛ</div>
                       <div class="text-gray-1000">Ссылка</div>
                       <div></div>
                    </div>
                     <?foreach ($arResult['requests']['mack'] as $request):?>
                        <div class="grid grid-cols-8 mt-4 bg-white info-row parent-request-container" data-request-id="<?=$request['ID']?>"  :class="requestServices<?=$request['ID']?>?'accordeon-active':''">

                           <div class="flex items-center"><?=$request['STATUS']?></div>
                           <div class="flex items-center"><?=$request['DATE_CREATE']?></div>
                           <div class="flex items-center"><?=$request['MANAGER']?></div>
                           <div class="flex items-center"><?=$request['LISING_OWNER']?></div>
                           <div class="flex items-center mr-4"><?=$request['LISING_GOAL']?></div>
                           <div class="flex items-center justify-center">
                              <button class="w-8 h-8 shadow-my flex justify-center items-center rounded" data-id="<?=$request['ID']?>" onclick="managerListPopup(this)">
                                 <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.53596 10.5265C6.5969 10.5875 6.66925 10.6358 6.74887 10.6688C6.82849 10.7018 6.91383 10.7187 7.00001 10.7187C7.08619 10.7187 7.17153 10.7018 7.25116 10.6688C7.33078 10.6358 7.40312 10.5875 7.46406 10.5265L9.93892 8.05167C10.062 7.9286 10.1311 7.76168 10.1311 7.58763C10.1311 7.41358 10.062 7.24666 9.93892 7.12359C9.81585 7.00052 9.64893 6.93138 9.47488 6.93138C9.30083 6.93138 9.13391 7.00052 9.01084 7.12359L7.65626 8.47818V1.3125C7.65626 1.13845 7.58712 0.971532 7.46405 0.848461C7.34098 0.72539 7.17406 0.65625 7.00001 0.65625C6.82596 0.65625 6.65904 0.72539 6.53597 0.848461C6.4129 0.971532 6.34376 1.13845 6.34376 1.3125V8.47818L4.98918 7.12359C4.86611 7.00052 4.69919 6.93138 4.52514 6.93138C4.3511 6.93138 4.18418 7.00052 4.06111 7.12359C3.93804 7.24666 3.8689 7.41358 3.8689 7.58763C3.8689 7.76168 3.93804 7.9286 4.06111 8.05167L6.53596 10.5265Z" fill="#28315F"/>
                                    <path d="M12.6875 6.34375C12.5135 6.34375 12.3465 6.41289 12.2235 6.53596C12.1004 6.65903 12.0312 6.82595 12.0312 7V12.0312H1.96875V7C1.96875 6.82595 1.89961 6.65903 1.77654 6.53596C1.65347 6.41289 1.48655 6.34375 1.3125 6.34375C1.13845 6.34375 0.971532 6.41289 0.848461 6.53596C0.72539 6.65903 0.65625 6.82595 0.65625 7V12.25C0.65625 12.5401 0.771484 12.8183 0.976602 13.0234C1.18172 13.2285 1.45992 13.3438 1.75 13.3438H12.25C12.5401 13.3438 12.8183 13.2285 13.0234 13.0234C13.2285 12.8183 13.3438 12.5401 13.3438 12.25V7C13.3438 6.82595 13.2746 6.65903 13.1515 6.53596C13.0285 6.41289 12.8615 6.34375 12.6875 6.34375Z" fill="#28315F"/>
                                 </svg>
                              </button>
                           </div>
                           <div class="flex items-center">
                              <button class="w-8 h-8 shadow-my flex justify-center items-center rounded" onclick="copyToClipboard('<?=$request['LINK']?>')">
                                 <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.46001 4.56631V4.61631H5.51001H6.49345H6.54345V4.56631V2.03777C6.54345 2.01362 6.56318 1.99388 6.58733 1.99388H14.9227C14.9468 1.99388 14.9666 2.01362 14.9666 2.03777V10.3731C14.9666 10.3973 14.9468 10.417 14.9227 10.417H12.473H12.423V10.467V11.4505V11.5005H12.473H14.9227C15.5443 11.5005 16.05 10.9948 16.05 10.3731V2.03777C16.05 1.41613 15.5443 0.910449 14.9227 0.910449H6.58733C5.96565 0.910449 5.46001 1.41613 5.46001 2.03777V4.56631Z" fill="#28315F" stroke="#28315F" stroke-width="0.1"/>
                                    <path d="M10.4561 14.9625V14.9642C10.4552 14.9876 10.4358 15.0064 10.4122 15.0064H2.07687C2.05267 15.0064 2.03295 14.9867 2.03295 14.9625V6.62716C2.03295 6.60298 2.05269 6.58324 2.07687 6.58324H10.4122C10.4364 6.58324 10.4561 6.60298 10.4561 6.62716V14.9625ZM10.4122 5.4998H2.07687C1.45519 5.4998 0.949512 6.00548 0.949512 6.62716V14.9625C0.949546 15.5842 1.45519 16.0898 2.07687 16.0898H10.4122C11.0339 16.0898 11.5396 15.5842 11.5396 14.9625V6.62716C11.5396 6.00548 11.0338 5.4998 10.4122 5.4998Z" fill="#28315F" stroke="#28315F" stroke-width="0.1"/>
                                 </svg>
                              </button>
                           </div>
                           <div class="flex items-center">
                              <div class="cursor-pointer" @click="requestServices<?=$request['ID']?>=!requestServices<?=$request['ID']?>">
                                 <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                 <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                 <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                              </div>
                           </div>
                        </div>
                        <!-- тело аккордеона -->
                        <div class="w-full bg-white py-4 accordeon-row px-4 border-t border-gray-1000" x-show="requestServices<?=$request['ID']?>">
                           <div class="w-full block mb-4">
                              <div class="grid grid-cols-5 w-full">
                                 <div class="text-gray-1000">Согласующий</div>
                                 <div class="text-gray-1000">Статус рассмотрения</div>
                                 <div class="text-gray-1000">Заключение</div>
                                 <div class="text-gray-1000">Действие</div>
                                 <div class="text-gray-1000">Дата и время принятия решения</div>
                              </div>
                           </div>
                            <?foreach ($request['MACK_RESULTS'] as $result):
                                ?>
                               <div class="my-2 accordeon-container" data-id="<?=$request['ID']?>">
                                  <div class="grid grid-cols-5 w-full">
                                     <div class="flex items-center">
                                        <div class="flex justify-start items-center">
                                           <div class="pr-2">
                                              <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                 <circle cx="16" cy="16" r="16" fill="#28315F"/>
                                                 <g clip-path="url(#clip0)">
                                                    <path d="M15.8975 15.7366C16.8504 15.7366 17.6756 15.3948 18.3498 14.7204C19.0241 14.0462 19.3658 13.2213 19.3658 12.2682C19.3658 11.3155 19.0241 10.4904 18.3497 9.81595C17.6754 9.14183 16.8503 8.80005 15.8975 8.80005C14.9444 8.80005 14.1194 9.14183 13.4452 9.81606C12.771 10.4903 12.4291 11.3154 12.4291 12.2682C12.4291 13.2213 12.771 14.0463 13.4453 14.7206C14.1197 15.3947 14.9447 15.7366 15.8975 15.7366Z" fill="white"/>
                                                    <path d="M21.9662 19.8728C21.9468 19.5923 21.9074 19.2862 21.8495 18.963C21.7911 18.6373 21.7158 18.3295 21.6257 18.0481C21.5327 17.7573 21.4061 17.4701 21.2497 17.1949C21.0873 16.9093 20.8966 16.6606 20.6826 16.4559C20.4588 16.2418 20.1848 16.0696 19.8679 15.944C19.5522 15.8191 19.2023 15.7558 18.828 15.7558C18.681 15.7558 18.5388 15.8162 18.2642 15.9949C18.0953 16.1051 17.8976 16.2325 17.677 16.3735C17.4884 16.4937 17.2328 16.6063 16.9172 16.7082C16.6093 16.8079 16.2966 16.8584 15.988 16.8584C15.6794 16.8584 15.3668 16.8079 15.0585 16.7082C14.7432 16.6064 14.4877 16.4938 14.2993 16.3736C14.0808 16.234 13.883 16.1065 13.7115 15.9948C13.4373 15.8161 13.295 15.7557 13.148 15.7557C12.7736 15.7557 12.4238 15.8191 12.1082 15.9442C11.7915 16.0695 11.5174 16.2417 11.2934 16.456C11.0795 16.6608 10.8887 16.9094 10.7265 17.1949C10.5702 17.4701 10.4436 17.7572 10.3505 18.0482C10.2605 18.3296 10.1852 18.6373 10.1268 18.963C10.0689 19.2857 10.0296 19.5919 10.0101 19.8732C9.99099 20.1487 9.98132 20.4347 9.98132 20.7235C9.98132 21.4752 10.2203 22.0837 10.6915 22.5325C11.1569 22.9754 11.7726 23.2 12.5215 23.2H19.4552C20.204 23.2 20.8196 22.9755 21.285 22.5325C21.7564 22.0841 21.9953 21.4754 21.9953 20.7234C21.9952 20.4333 21.9854 20.1471 21.9662 19.8728Z" fill="white"/>
                                                 </g>
                                                 <defs>
                                                    <clipPath id="clip0">
                                                       <rect width="14.4" height="14.4" fill="white" transform="translate(8.80005 8.80005)"/>
                                                    </clipPath>
                                                 </defs>
                                              </svg>
                                           </div>
                                           <div class="px-2 text-gray-1000 sb-responsible" data-id="<?=$request['ID']?>">
                                               <?=$result['FIO']?>
                                           </div>
                                        </div>
                                     </div>
                                     <div class="cursor-pointer flex items-center status">
                                         <?if($result['STATUS'] === NULL){?>
                                            <div class="flex justify-start items-center shadow-my rounded-my">
                                               <div class="px-2 result<?=$result['ID']?>">
                                                  <input class="hidden" type="radio" id="1contactChoice<?=$result['ID']?>" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="accept">
                                                  <label for="1contactChoice<?=$result['ID']?>" class="mx-3 my-4 cursor-pointer acceptions" title="согласовать">
                                                     <div class="flex items-center">
                                                        <svg width="19" height="18" viewBox="0 0 19 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                           <path d="M18.3763 15.4422C18.3763 15.4109 18.3712 15.3812 18.3669 15.3509V8.33037H18.3666L18.3669 8.32802C18.3669 8.24116 18.3492 8.15515 18.3149 8.0749C18.2806 7.99466 18.2304 7.92175 18.167 7.86034C18.1036 7.79893 18.0284 7.75023 17.9456 7.71701C17.8628 7.68379 17.7741 7.66671 17.6845 7.66675C17.6718 7.66675 17.6603 7.66962 17.6479 7.6704H16.357V7.67509C16.1806 7.67982 16.0129 7.75079 15.8894 7.87304C15.7659 7.99529 15.6962 8.15926 15.695 8.33037H15.6929V15.5016H15.7044C15.7198 15.661 15.7945 15.8094 15.9146 15.9192C16.0347 16.029 16.192 16.0925 16.357 16.098V16.1037H17.6941C18.0707 16.1037 18.3763 15.8075 18.3763 15.4422Z" fill="#28315F"/>
                                                           <path d="M14.3429 16.5429V7.02723L14.3432 7.02488C14.3432 6.93802 14.3255 6.85201 14.2912 6.77176C14.2569 6.69152 14.2067 6.61861 14.1433 6.5572C14.0799 6.49579 14.0047 6.44709 13.9219 6.41387C13.8391 6.38065 13.7504 6.36357 13.6608 6.36361C13.6484 6.36361 13.6366 6.36648 13.6242 6.36726H10.9526C10.9129 6.30558 10.8643 6.24966 10.8084 6.20116L8.15081 1.73835L8.14409 1.74226C7.87779 1.28516 7.37801 0.976685 6.80452 0.976685C5.95156 0.976685 5.25999 1.65673 5.25999 2.49558H5.24439V6.367H1.56355V6.37169C1.3871 6.37642 1.21945 6.44739 1.09595 6.56964C0.972448 6.69189 0.902754 6.85586 0.901566 7.02697H0.899414V14.3677H0.901028C0.901028 14.4519 0.934383 14.5362 1.00002 14.6008L0.999209 14.6016L3.62561 17.1476L3.63207 17.1414C3.70766 17.2016 3.80046 17.2243 3.89218 17.2123H13.6035C13.6231 17.2139 13.6419 17.218 13.6619 17.218C13.8363 17.2178 14.0041 17.1525 14.1304 17.0358C14.2567 16.9191 14.3319 16.7599 14.3405 16.5909H14.3427V16.5706C14.3427 16.5659 14.344 16.5614 14.344 16.5568C14.344 16.5521 14.3432 16.5476 14.3429 16.5429ZM1.7045 14.3677L1.7158 14.38L1.70315 14.3677H1.7045Z" fill="#28315F"/>
                                                        </svg>

                                                     </div>
                                                  </label>
                                               </div>
                                               <div class="px-2 result<?=$result['ID']?>">
                                                  <input class="hidden" type="radio" id="2contactChoice<?=$result['ID']?>" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="decline">
                                                  <label for="2contactChoice<?=$result['ID']?>" class="mx-3 my-4 cursor-pointer acceptions" title="отклонить">
                                                     <div class="flex items-center ">
                                                        <svg width="19" height="17" viewBox="0 0 19 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                           <path d="M0.682781 1.89876C0.682781 1.93005 0.687891 1.95978 0.692195 1.99002L0.692194 9.01057L0.692463 9.01057L0.692194 9.01292C0.692194 9.09978 0.709848 9.18579 0.744146 9.26604C0.778444 9.34629 0.828716 9.4192 0.892089 9.4806C0.955461 9.54201 1.03069 9.59072 1.11349 9.62393C1.19628 9.65715 1.28501 9.67423 1.37462 9.67419C1.38726 9.67419 1.39883 9.67133 1.4112 9.67054L2.70208 9.67054L2.70208 9.66585C2.87852 9.66112 3.04617 9.59015 3.16968 9.4679C3.29318 9.34565 3.36287 9.18168 3.36406 9.01057L3.36621 9.01057L3.36621 1.83931L3.35465 1.83931C3.3393 1.67998 3.26457 1.53153 3.14445 1.42176C3.02434 1.31199 2.86706 1.24842 2.70208 1.24296L2.70208 1.23723L1.36494 1.23723C0.988351 1.23723 0.682781 1.53344 0.682781 1.89876Z" fill="#28315F"/>
                                                           <path d="M4.71664 0.798007L4.71664 10.3137L4.71637 10.3161C4.71637 10.4029 4.73403 10.4889 4.76832 10.5692C4.80262 10.6494 4.85289 10.7223 4.91626 10.7837C4.97964 10.8452 5.05487 10.8939 5.13766 10.9271C5.22046 10.9603 5.30919 10.9774 5.39879 10.9773C5.41117 10.9773 5.423 10.9745 5.43538 10.9737L8.10697 10.9737C8.14672 11.0354 8.19526 11.0913 8.25115 11.1398L10.9088 15.6026L10.9155 15.5987C11.1818 16.0558 11.6816 16.3643 12.255 16.3643C13.108 16.3643 13.7996 15.6842 13.7996 14.8454L13.8152 14.8454L13.8152 10.9739L17.496 10.9739L17.496 10.9693C17.6725 10.9645 17.8401 10.8935 17.9636 10.7713C18.0871 10.649 18.1568 10.4851 18.158 10.314L18.1602 10.314L18.1602 2.97322L18.1585 2.97322C18.1585 2.889 18.1252 2.80477 18.0596 2.74011L18.0604 2.73932L15.434 0.193319L15.4275 0.199577C15.3519 0.139343 15.2591 0.116657 15.1674 0.12865L5.45609 0.12865C5.43646 0.127086 5.41762 0.122914 5.39772 0.122914C5.22323 0.123175 5.05551 0.188395 4.92921 0.305104C4.80291 0.421811 4.72768 0.581088 4.71906 0.750028L4.71691 0.750028L4.71691 0.770366C4.71691 0.77506 4.71556 0.779492 4.71556 0.784186C4.71556 0.78888 4.71637 0.793313 4.71664 0.798007ZM17.3551 2.97322L17.3438 2.96096L17.3564 2.97322L17.3551 2.97322Z" fill="#28315F"/>
                                                        </svg>
                                                     </div>
                                                  </label>
                                               </div>
                                               <div class="px-2 result<?=$result['ID']?>">
                                                  <input class="hidden" type="radio" id="3contactChoice<?=$result['ID']?>" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="ignore">
                                                  <label for="3contactChoice<?=$result['ID']?>" class="mx-3 my-4 cursor-pointer acceptions" title="воздержаться">
                                                     <div class="flex items-center">
                                                        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                           <g clip-path="url(#clip0)">
                                                              <path d="M16.6033 5.78419C17.2111 5.78419 17.7037 5.30661 17.7037 4.71748C17.7037 4.12834 17.2111 3.65076 16.6033 3.65076C15.9956 3.65076 15.5029 4.12834 15.5029 4.71748C15.5029 5.30661 15.9956 5.78419 16.6033 5.78419Z" fill="#28315F"/>
                                                              <path d="M13.6688 3.65077C14.2765 3.65077 14.7692 3.17319 14.7692 2.58405C14.7692 1.99492 14.2765 1.51733 13.6688 1.51733C13.061 1.51733 12.5684 1.99492 12.5684 2.58405C12.5684 3.17319 13.061 3.65077 13.6688 3.65077Z" fill="#28315F"/>
                                                              <path d="M10.7347 2.93959C11.3424 2.93959 11.8351 2.462 11.8351 1.87287C11.8351 1.28374 11.3424 0.806152 10.7347 0.806152C10.1269 0.806152 9.63428 1.28374 9.63428 1.87287C9.63428 2.462 10.1269 2.93959 10.7347 2.93959Z" fill="#28315F"/>
                                                              <path d="M7.80011 4.36195C8.40785 4.36195 8.90052 3.88437 8.90052 3.29523C8.90052 2.7061 8.40785 2.22852 7.80011 2.22852C7.19237 2.22852 6.69971 2.7061 6.69971 3.29523C6.69971 3.88437 7.19237 4.36195 7.80011 4.36195Z" fill="#28315F"/>
                                                              <path d="M15.5029 4.71739V9.33983C15.5029 9.53611 15.3386 9.69541 15.1361 9.69541C14.9336 9.69541 14.7693 9.53611 14.7693 9.33983V2.58395H12.5685V8.62869C12.5685 8.82496 12.4041 8.98426 12.2017 8.98426C11.9992 8.98426 11.8349 8.82496 11.8349 8.62869V1.8728H9.63406V8.62869C9.63406 8.82496 9.46973 8.98426 9.26726 8.98426C9.06479 8.98426 8.90046 8.82496 8.90046 8.62869V3.29509H6.69965V12.1844L5.2141 10.2138C4.77394 9.55602 3.91489 9.33557 3.28546 9.71247C2.65823 10.0979 2.5027 10.9385 2.937 11.5942C2.937 11.5942 5.33295 15.1094 6.35412 16.6141C7.3753 18.1189 9.02957 19.2959 12.1232 19.2959C17.2452 19.2959 17.7037 15.4614 17.7037 14.3179C17.7037 13.1743 17.7037 4.71739 17.7037 4.71739H15.5029Z" fill="#28315F"/>
                                                           </g>
                                                           <defs>
                                                              <clipPath id="clip0">
                                                                 <rect width="19.0737" height="18.4898" fill="white" transform="translate(0.660645 0.806152)"/>
                                                              </clipPath>
                                                           </defs>
                                                        </svg>
                                                     </div>
                                                  </label>
                                               </div>
                                               <div class="px-2 result<?=$result['ID']?>">
                                                  <input class="hidden" type="radio" id="4contactChoice<?=$result['ID']?>" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="edit">
                                                  <label for="4contactChoice<?=$result['ID']?>" class="mx-3 my-4 cursor-pointer acceptions" title="доработать">
                                                     <div class="flex items-center">
                                                        <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                           <g clip-path="url(#clip0)">
                                                              <path d="M10.837 3.65295L1.21694 12.9792C1.16854 13.0262 1.13359 13.0857 1.11695 13.1495L0.0506573 17.2984C0.0187615 17.4233 0.0566205 17.5561 0.150644 17.6472C0.221785 17.7162 0.318721 17.7544 0.417875 17.7544C0.448246 17.7544 0.47931 17.7507 0.509541 17.7433L4.78941 16.7096C4.85611 16.6934 4.91671 16.6597 4.96511 16.6128L14.586 7.2872L10.837 3.65295Z" fill="#28315F"/>
                                                              <path d="M16.9693 2.3818L15.8984 1.34371C15.1827 0.649905 13.9353 0.650577 13.2204 1.34371L11.9087 2.61531L15.6575 6.24941L16.9693 4.97782C17.3268 4.63139 17.5237 4.17028 17.5237 3.67987C17.5237 3.18947 17.3268 2.72836 16.9693 2.3818Z" fill="#28315F"/>
                                                           </g>
                                                           <defs>
                                                              <clipPath id="clip0">
                                                                 <rect width="17.4842" height="16.949" fill="white" transform="translate(0.0395508 0.806152)"/>
                                                              </clipPath>
                                                           </defs>
                                                        </svg>

                                                     </div>
                                                  </label>
                                               </div>

                                            </div>

                                         <?}elseif($result['STATUS'] === 'Согласовано'){?>
                                            <div class="flex justify-center items-center">
                                               <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                  <rect width="37" height="30" rx="6" fill="#91B23B"/>
                                                  <path d="M24.1394 19.1181C24.1394 19.0978 24.1362 19.0785 24.1335 19.0589V14.5025H24.1333L24.1335 14.5009C24.1335 14.4446 24.1224 14.3888 24.1008 14.3367C24.0792 14.2846 24.0476 14.2373 24.0077 14.1974C23.9679 14.1576 23.9205 14.126 23.8684 14.1044C23.8164 14.0828 23.7605 14.0718 23.7042 14.0718C23.6962 14.0718 23.6889 14.0736 23.6811 14.0741H22.869V14.0772C22.758 14.0803 22.6525 14.1263 22.5748 14.2057C22.4971 14.285 22.4533 14.3914 22.4525 14.5025H22.4512V19.1567H22.4584C22.4681 19.2601 22.5151 19.3564 22.5907 19.4277C22.6663 19.4989 22.7652 19.5402 22.869 19.5437V19.5474H23.7103C23.9472 19.5474 24.1394 19.3552 24.1394 19.1181Z" fill="white"/>
                                                  <path d="M21.6014 19.8323V13.6566L21.6016 13.6551C21.6016 13.5987 21.5905 13.5429 21.5689 13.4908C21.5473 13.4387 21.5157 13.3914 21.4758 13.3515C21.4359 13.3117 21.3886 13.2801 21.3365 13.2585C21.2844 13.2369 21.2286 13.2259 21.1722 13.2259C21.1644 13.2259 21.157 13.2277 21.1492 13.2283H19.4684C19.4434 13.1882 19.4129 13.1519 19.3777 13.1205L17.7057 10.2241L17.7015 10.2266C17.5339 9.92994 17.2195 9.72974 16.8587 9.72974C16.3221 9.72974 15.887 10.1711 15.887 10.7155H15.8771V13.2281H13.5614V13.2311C13.4504 13.2342 13.3449 13.2803 13.2672 13.3596C13.1895 13.4389 13.1457 13.5454 13.1449 13.6564H13.1436V18.4206H13.1446C13.1446 18.4753 13.1656 18.5299 13.2068 18.5719L13.2063 18.5724L14.8587 20.2248L14.8628 20.2207C14.9103 20.2598 14.9687 20.2745 15.0264 20.2668H21.1362C21.1485 20.2678 21.1604 20.2705 21.1729 20.2705C21.2827 20.2703 21.3882 20.228 21.4677 20.1522C21.5471 20.0765 21.5944 19.9731 21.5999 19.8635H21.6012V19.8503C21.6012 19.8472 21.6021 19.8444 21.6021 19.8413C21.6021 19.8383 21.6016 19.8354 21.6014 19.8323ZM13.6501 18.4206L13.6572 18.4286L13.6492 18.4206H13.6501Z" fill="white"/>
                                               </svg>
                                            </div>
                                         <?}elseif($result['STATUS'] === 'Отказано'){?>
                                            <div class="flex justify-center items-center">
                                               <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                  <rect width="37" height="30" rx="6" fill="#EA4335"/>
                                                  <path d="M13.1399 11.8819C13.1399 11.9022 13.1431 11.9215 13.1458 11.9411L13.1458 16.4975L13.146 16.4975L13.1458 16.4991C13.1458 16.5554 13.1569 16.6112 13.1785 16.6633C13.2001 16.7154 13.2317 16.7627 13.2716 16.8026C13.3114 16.8424 13.3588 16.874 13.4108 16.8956C13.4629 16.9172 13.5188 16.9282 13.5751 16.9282C13.5831 16.9282 13.5904 16.9264 13.5982 16.9259L14.4103 16.9259L14.4103 16.9228C14.5213 16.9197 14.6268 16.8737 14.7045 16.7943C14.7822 16.715 14.826 16.6086 14.8268 16.4975L14.8281 16.4975L14.8281 11.8433L14.8208 11.8433C14.8112 11.7399 14.7642 11.6436 14.6886 11.5723C14.613 11.5011 14.5141 11.4598 14.4103 11.4563L14.4103 11.4526L13.569 11.4526C13.3321 11.4526 13.1399 11.6448 13.1399 11.8819Z" fill="white"/>
                                                  <path d="M15.6779 11.1677L15.6779 17.3434L15.6777 17.3449C15.6777 17.4013 15.6888 17.4571 15.7104 17.5092C15.732 17.5613 15.7636 17.6086 15.8035 17.6485C15.8434 17.6883 15.8907 17.7199 15.9428 17.7415C15.9949 17.7631 16.0507 17.7741 16.1071 17.7741C16.1149 17.7741 16.1223 17.7723 16.1301 17.7717L17.8109 17.7717C17.8359 17.8118 17.8664 17.8481 17.9016 17.8795L19.5736 20.7759L19.5778 20.7734C19.7454 21.0701 20.0598 21.2703 20.4206 21.2703C20.9572 21.2703 21.3923 20.8289 21.3923 20.2845L21.4021 20.2845L21.4021 17.7719L23.7179 17.7719L23.7179 17.7689C23.8289 17.7658 23.9344 17.7197 24.0121 17.6404C24.0898 17.5611 24.1336 17.4546 24.1344 17.3436L24.1357 17.3436L24.1357 12.5794L24.1347 12.5794C24.1347 12.5247 24.1137 12.4701 24.0725 12.4281L24.073 12.4276L22.4206 10.7752L22.4165 10.7793C22.369 10.7402 22.3106 10.7255 22.2529 10.7332L16.1431 10.7332C16.1308 10.7322 16.1189 10.7295 16.1064 10.7295C15.9966 10.7297 15.8911 10.772 15.8116 10.8478C15.7322 10.9235 15.6848 11.0269 15.6794 11.1365L15.6781 11.1365L15.6781 11.1497C15.6781 11.1528 15.6772 11.1556 15.6772 11.1587C15.6772 11.1617 15.6777 11.1646 15.6779 11.1677ZM23.6292 12.5794L23.6221 12.5714L23.6301 12.5794L23.6292 12.5794Z" fill="white"/>
                                               </svg>
                                            </div>
                                         <?}elseif($result['STATUS'] === 'Воздержался'){?>
                                            <div class="flex justify-center items-center">
                                               <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                  <rect width="37" height="30" rx="6" fill="#FFC700"/>
                                                  <path d="M23.0302 12.2308C23.4126 12.2308 23.7225 11.9208 23.7225 11.5385C23.7225 11.1561 23.4126 10.8462 23.0302 10.8462C22.6478 10.8462 22.3379 11.1561 22.3379 11.5385C22.3379 11.9208 22.6478 12.2308 23.0302 12.2308Z" fill="white"/>
                                                  <path d="M21.1845 10.8462C21.5668 10.8462 21.8768 10.5362 21.8768 10.1539C21.8768 9.7715 21.5668 9.46155 21.1845 9.46155C20.8021 9.46155 20.4922 9.7715 20.4922 10.1539C20.4922 10.5362 20.8021 10.8462 21.1845 10.8462Z" fill="white"/>
                                                  <path d="M19.3378 10.3846C19.7202 10.3846 20.0301 10.0747 20.0301 9.69231C20.0301 9.30996 19.7202 9 19.3378 9C18.9555 9 18.6455 9.30996 18.6455 9.69231C18.6455 10.0747 18.9555 10.3846 19.3378 10.3846Z" fill="white"/>
                                                  <path d="M17.4921 11.3077C17.8745 11.3077 18.1844 10.9978 18.1844 10.6154C18.1844 10.2331 17.8745 9.9231 17.4921 9.9231C17.1098 9.9231 16.7998 10.2331 16.7998 10.6154C16.7998 10.9978 17.1098 11.3077 17.4921 11.3077Z" fill="white"/>
                                                  <path d="M22.3379 11.5384V14.5384C22.3379 14.6658 22.2345 14.7692 22.1071 14.7692C21.9797 14.7692 21.8763 14.6658 21.8763 14.5384V10.1538H20.4917V14.0769C20.4917 14.2043 20.3883 14.3076 20.2609 14.3076C20.1335 14.3076 20.0302 14.2043 20.0302 14.0769V9.69226H18.6455V14.0769C18.6455 14.2043 18.5422 14.3076 18.4148 14.3076C18.2874 14.3076 18.184 14.2043 18.184 14.0769V10.6153H16.7994V16.3846L15.8648 15.1056C15.5879 14.6787 15.0474 14.5356 14.6514 14.7803C14.2568 15.0304 14.1589 15.576 14.4322 16.0015C14.4322 16.0015 15.9395 18.2829 16.582 19.2595C17.2245 20.2361 18.2652 21 20.2115 21C23.434 21 23.7225 18.5113 23.7225 17.7692C23.7225 17.027 23.7225 11.5384 23.7225 11.5384H22.3379Z" fill="white"/>
                                               </svg>

                                            </div>
                                         <?}elseif($result['STATUS'] === 'На доработку'){?>
                                            <div class="flex justify-center items-center">
                                               <svg width="39" height="32" viewBox="0 0 39 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                  <rect x="1" y="1" width="37" height="30" rx="6" fill="white" stroke="#D9DCEA"/>
                                                  <g clip-path="url(#clip0)">
                                                     <path d="M21.837 10.653L12.2169 19.9792C12.1685 20.0262 12.1336 20.0857 12.1169 20.1495L11.0507 24.2984C11.0188 24.4233 11.0566 24.5561 11.1506 24.6472C11.2218 24.7162 11.3187 24.7544 11.4179 24.7544C11.4482 24.7544 11.4793 24.7507 11.5095 24.7433L15.7894 23.7096C15.8561 23.6934 15.9167 23.6597 15.9651 23.6128L25.586 14.2872L21.837 10.653Z" fill="#28315F"/>
                                                     <path d="M27.9693 9.3818L26.8984 8.34371C26.1827 7.64991 24.9353 7.65058 24.2204 8.34371L22.9087 9.61531L26.6575 13.2494L27.9693 11.9778C28.3268 11.6314 28.5237 11.1703 28.5237 10.6799C28.5237 10.1895 28.3268 9.72836 27.9693 9.3818Z" fill="#28315F"/>
                                                  </g>
                                                  <defs>
                                                     <clipPath id="clip0">
                                                        <rect width="17.4842" height="16.949" fill="white" transform="translate(11.0396 7.80615)"/>
                                                     </clipPath>
                                                  </defs>
                                               </svg>
                                            </div>
                                         <?}?>
                                     </div>
                                     <div class="text-gray-1000 flex items-center conclusion">
                                         <?if(!$result['RESULT'] && $result['STATUS'] === NULL){?>
                                            <div class="flex items-center cursor-pointer">
                                               <textarea class="rounded-my border border-gray-1000 resize-none py-4 px-4 outline-none text-gray-1000" cols="30" rows="2" placeholder="Введите комментарий..." data-id="<?=$result['ID']?>"></textarea>
                                               <!--                                                  <div class="ml-4">-->
                                               <!--                                                     <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">-->
                                               <!--                                                        <path d="M11 0C4.91979 0 0 4.92022 0 11C0 17.0802 4.92022 22 11 22C17.0802 22 22 17.0798 22 11C22 4.91979 17.0798 0 11 0ZM11 20.2812C5.86983 20.2812 1.71875 16.1298 1.71875 11C1.71875 5.86983 5.87018 1.71875 11 1.71875C16.1302 1.71875 20.2812 5.87018 20.2812 11C20.2812 16.1302 16.1298 20.2812 11 20.2812Z" fill="#28315F"/>-->
                                               <!--                                                        <path d="M11 5.53772C10.5254 5.53772 10.1406 5.92246 10.1406 6.39709V11.9312C10.1406 12.4058 10.5254 12.7905 11 12.7905C11.4746 12.7905 11.8594 12.4058 11.8594 11.9312V6.39709C11.8594 5.92246 11.4746 5.53772 11 5.53772Z" fill="#28315F"/>-->
                                               <!--                                                        <path d="M11 16.1631C11.6407 16.1631 12.1602 15.6437 12.1602 15.0029C12.1602 14.3622 11.6407 13.8428 11 13.8428C10.3593 13.8428 9.83984 14.3622 9.83984 15.0029C9.83984 15.6437 10.3593 16.1631 11 16.1631Z" fill="#28315F"/>-->
                                               <!--                                                     </svg>-->
                                               <!--                                                  </div>-->
                                            </div>
                                         <?}else{echo $result['RESULT'];}?>
                                     </div>
                                     <div class="text-gray-1000 flex items-center dejstvije">
                                         <?if($result['STATUS'] === NULL){?>
                                            <button class="flex items-center py-2 px-2 text-white bg-green-1000 font-semibold rounded-2xl cursor-pointer" onclick="sendCommiteeMackResult(this)" data-id="<?=$result['ID']?>">Отправить решение</button>
                                         <?}else {echo '-';}?>
                                     </div>
                                     <div class="text-gray-1000 flex justify-center items-center conclusion-time">
                                         <?=$result['DATE']?$result['DATE']:'-';?>
                                     </div>
                                  </div>
                               </div>
                               <hr class="my-4">
                            <?endforeach;?>
                        </div>
                        <!-- тело аккордеона -->
                     <?endforeach;?>
                     <?if(count($arResult['requests']['mack']) === 0 ){?>
                        <div class="flex justify-center items-center mt-4 bg-white info-row">Заявок нет</div>
                     <?}?>
                 </div>
                 <div x-show="underwriting">
                    <div class="grid grid-cols-8">
                       <div class="text-gray-1000">Статус заявки</div>
                       <div class="text-gray-1000">Время и дата создания</div>
                       <div class="text-gray-1000">Менеджер</div>
                       <div class="text-gray-1000">Лизингополучатель</div>
                       <div class="text-gray-1000">Предмет лизинга</div>
                       <div class="text-gray-1000">Итоговый ИЛ</div>
                       <div class="text-gray-1000">Ссылка</div>
                       <div></div>
                    </div>
                     <?
                     foreach ($arResult['requests']['underwriting'] as $request):?>
                        <div class="underwriting-request-parent-container parent-request-container" data-request-id="<?=$request['ID']?>">
                           <!-- шапка заявки -->
                           <div class="grid grid-cols-8 mt-4 bg-white info-row" :class="requestServices<?=$request['ID']?>?'accordeon-active':''">
                              <div class="flex items-center"><?=$request['STATUS']?></div>
                              <div class="flex items-center"><?=$request['DATE_CREATE']?></div>
                              <div class="flex items-center"><?=$request['MANAGER']?></div>
                              <div class="flex items-center"><?=$request['LISING_OWNER']?></div>
                              <div class="flex items-center mr-4"><?=$request['LISING_GOAL']?></div>
                              <div class="flex items-center justify-center">
                                 <button class="w-8 h-8 shadow-my flex justify-center items-center rounded" data-id="<?=$request['ID']?>" onclick="managerListPopup(this)">
                                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                       <path d="M6.53596 10.5265C6.5969 10.5875 6.66925 10.6358 6.74887 10.6688C6.82849 10.7018 6.91383 10.7187 7.00001 10.7187C7.08619 10.7187 7.17153 10.7018 7.25116 10.6688C7.33078 10.6358 7.40312 10.5875 7.46406 10.5265L9.93892 8.05167C10.062 7.9286 10.1311 7.76168 10.1311 7.58763C10.1311 7.41358 10.062 7.24666 9.93892 7.12359C9.81585 7.00052 9.64893 6.93138 9.47488 6.93138C9.30083 6.93138 9.13391 7.00052 9.01084 7.12359L7.65626 8.47818V1.3125C7.65626 1.13845 7.58712 0.971532 7.46405 0.848461C7.34098 0.72539 7.17406 0.65625 7.00001 0.65625C6.82596 0.65625 6.65904 0.72539 6.53597 0.848461C6.4129 0.971532 6.34376 1.13845 6.34376 1.3125V8.47818L4.98918 7.12359C4.86611 7.00052 4.69919 6.93138 4.52514 6.93138C4.3511 6.93138 4.18418 7.00052 4.06111 7.12359C3.93804 7.24666 3.8689 7.41358 3.8689 7.58763C3.8689 7.76168 3.93804 7.9286 4.06111 8.05167L6.53596 10.5265Z" fill="#28315F"/>
                                       <path d="M12.6875 6.34375C12.5135 6.34375 12.3465 6.41289 12.2235 6.53596C12.1004 6.65903 12.0312 6.82595 12.0312 7V12.0312H1.96875V7C1.96875 6.82595 1.89961 6.65903 1.77654 6.53596C1.65347 6.41289 1.48655 6.34375 1.3125 6.34375C1.13845 6.34375 0.971532 6.41289 0.848461 6.53596C0.72539 6.65903 0.65625 6.82595 0.65625 7V12.25C0.65625 12.5401 0.771484 12.8183 0.976602 13.0234C1.18172 13.2285 1.45992 13.3438 1.75 13.3438H12.25C12.5401 13.3438 12.8183 13.2285 13.0234 13.0234C13.2285 12.8183 13.3438 12.5401 13.3438 12.25V7C13.3438 6.82595 13.2746 6.65903 13.1515 6.53596C13.0285 6.41289 12.8615 6.34375 12.6875 6.34375Z" fill="#28315F"/>
                                    </svg>
                                 </button>
                              </div>
                              <div class="flex items-center">
                                 <button class="w-8 h-8 shadow-my flex justify-center items-center rounded" onclick="copyToClipboard('<?=$request['LINK']?>')">
                                    <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                       <path d="M5.46001 4.56631V4.61631H5.51001H6.49345H6.54345V4.56631V2.03777C6.54345 2.01362 6.56318 1.99388 6.58733 1.99388H14.9227C14.9468 1.99388 14.9666 2.01362 14.9666 2.03777V10.3731C14.9666 10.3973 14.9468 10.417 14.9227 10.417H12.473H12.423V10.467V11.4505V11.5005H12.473H14.9227C15.5443 11.5005 16.05 10.9948 16.05 10.3731V2.03777C16.05 1.41613 15.5443 0.910449 14.9227 0.910449H6.58733C5.96565 0.910449 5.46001 1.41613 5.46001 2.03777V4.56631Z" fill="#28315F" stroke="#28315F" stroke-width="0.1"/>
                                       <path d="M10.4561 14.9625V14.9642C10.4552 14.9876 10.4358 15.0064 10.4122 15.0064H2.07687C2.05267 15.0064 2.03295 14.9867 2.03295 14.9625V6.62716C2.03295 6.60298 2.05269 6.58324 2.07687 6.58324H10.4122C10.4364 6.58324 10.4561 6.60298 10.4561 6.62716V14.9625ZM10.4122 5.4998H2.07687C1.45519 5.4998 0.949512 6.00548 0.949512 6.62716V14.9625C0.949546 15.5842 1.45519 16.0898 2.07687 16.0898H10.4122C11.0339 16.0898 11.5396 15.5842 11.5396 14.9625V6.62716C11.5396 6.00548 11.0338 5.4998 10.4122 5.4998Z" fill="#28315F" stroke="#28315F" stroke-width="0.1"/>
                                    </svg>
                                 </button>
                              </div>
                              <div class="flex items-center">
                                 <div class="cursor-pointer" @click="requestServices<?=$request['ID']?>=!requestServices<?=$request['ID']?>">
                                    <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                    <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                    <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                 </div>
                              </div>
                           </div>
                           <!-- шапка заявки -->
                           <!-- тело аккордеона -->
                           <div class="w-full bg-white py-4 accordeon-row px-4 border-t border-gray-1000" x-show="requestServices<?=$request['ID']?>">
                              <div class="w-full block mb-4">
                                 <div class="grid grid-cols-5 w-full">
                                    <div class="text-gray-1000">Согласующий</div>
                                    <div class="text-gray-1000">Статус рассмотрения</div>
                                    <div class="text-gray-1000">Заключение</div>
                                    <div class="text-gray-1000">Действия</div>
                                    <div class="text-gray-1000">Дата и время принятия решения</div>
                                 </div>
                              </div>
                               <?
                               foreach ($request['UNDERWRITING_RESULTS'] as $result):
                                   if($result['HEAD'] === 'YES') {
                                       $headRequestIDUnder = $result['ID'];
                                   }
                                   ?>
                                  <div class="my-2 accordeon-container" data-id="<?=$request['ID']?>">
                                     <div class="grid grid-cols-5 w-full">
                                        <div class="flex items-center">
                                           <div class="flex justify-start items-center">
                                              <div class="pr-2">
                                                 <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="16" cy="16" r="16" fill="#28315F"/>
                                                    <g clip-path="url(#clip0)">
                                                       <path d="M15.8975 15.7366C16.8504 15.7366 17.6756 15.3948 18.3498 14.7204C19.0241 14.0462 19.3658 13.2213 19.3658 12.2682C19.3658 11.3155 19.0241 10.4904 18.3497 9.81595C17.6754 9.14183 16.8503 8.80005 15.8975 8.80005C14.9444 8.80005 14.1194 9.14183 13.4452 9.81606C12.771 10.4903 12.4291 11.3154 12.4291 12.2682C12.4291 13.2213 12.771 14.0463 13.4453 14.7206C14.1197 15.3947 14.9447 15.7366 15.8975 15.7366Z" fill="white"/>
                                                       <path d="M21.9662 19.8728C21.9468 19.5923 21.9074 19.2862 21.8495 18.963C21.7911 18.6373 21.7158 18.3295 21.6257 18.0481C21.5327 17.7573 21.4061 17.4701 21.2497 17.1949C21.0873 16.9093 20.8966 16.6606 20.6826 16.4559C20.4588 16.2418 20.1848 16.0696 19.8679 15.944C19.5522 15.8191 19.2023 15.7558 18.828 15.7558C18.681 15.7558 18.5388 15.8162 18.2642 15.9949C18.0953 16.1051 17.8976 16.2325 17.677 16.3735C17.4884 16.4937 17.2328 16.6063 16.9172 16.7082C16.6093 16.8079 16.2966 16.8584 15.988 16.8584C15.6794 16.8584 15.3668 16.8079 15.0585 16.7082C14.7432 16.6064 14.4877 16.4938 14.2993 16.3736C14.0808 16.234 13.883 16.1065 13.7115 15.9948C13.4373 15.8161 13.295 15.7557 13.148 15.7557C12.7736 15.7557 12.4238 15.8191 12.1082 15.9442C11.7915 16.0695 11.5174 16.2417 11.2934 16.456C11.0795 16.6608 10.8887 16.9094 10.7265 17.1949C10.5702 17.4701 10.4436 17.7572 10.3505 18.0482C10.2605 18.3296 10.1852 18.6373 10.1268 18.963C10.0689 19.2857 10.0296 19.5919 10.0101 19.8732C9.99099 20.1487 9.98132 20.4347 9.98132 20.7235C9.98132 21.4752 10.2203 22.0837 10.6915 22.5325C11.1569 22.9754 11.7726 23.2 12.5215 23.2H19.4552C20.204 23.2 20.8196 22.9755 21.285 22.5325C21.7564 22.0841 21.9953 21.4754 21.9953 20.7234C21.9952 20.4333 21.9854 20.1471 21.9662 19.8728Z" fill="white"/>
                                                    </g>
                                                    <defs>
                                                       <clipPath id="clip0">
                                                          <rect width="14.4" height="14.4" fill="white" transform="translate(8.80005 8.80005)"/>
                                                       </clipPath>
                                                    </defs>
                                                 </svg>
                                              </div>
                                              <div class="px-2 text-gray-1000 sb-responsible" data-id="<?=$request['ID']?>">
                                                  <?=$result['FIO']?>
                                              </div>
                                           </div>
                                        </div>
                                        <div class="cursor-pointer status flex items-center">
                                            <?if($result['STATUS'] === NULL){?>
                                               <div class="flex justify-start items-center shadow-my rounded-my">
                                                  <div class="px-2 result<?=$result['ID']?>">
                                                     <input class="hidden" type="radio" id="contactChoice1" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="accept">
                                                     <label for="contactChoice1" class="mx-3 my-4 cursor-pointer acceptions" title="согласовать">
                                                        <div class="flex items-center">
                                                           <svg width="19" height="18" viewBox="0 0 19 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                              <path d="M18.3763 15.4422C18.3763 15.4109 18.3712 15.3812 18.3669 15.3509V8.33037H18.3666L18.3669 8.32802C18.3669 8.24116 18.3492 8.15515 18.3149 8.0749C18.2806 7.99466 18.2304 7.92175 18.167 7.86034C18.1036 7.79893 18.0284 7.75023 17.9456 7.71701C17.8628 7.68379 17.7741 7.66671 17.6845 7.66675C17.6718 7.66675 17.6603 7.66962 17.6479 7.6704H16.357V7.67509C16.1806 7.67982 16.0129 7.75079 15.8894 7.87304C15.7659 7.99529 15.6962 8.15926 15.695 8.33037H15.6929V15.5016H15.7044C15.7198 15.661 15.7945 15.8094 15.9146 15.9192C16.0347 16.029 16.192 16.0925 16.357 16.098V16.1037H17.6941C18.0707 16.1037 18.3763 15.8075 18.3763 15.4422Z" fill="#28315F"/>
                                                              <path d="M14.3429 16.5429V7.02723L14.3432 7.02488C14.3432 6.93802 14.3255 6.85201 14.2912 6.77176C14.2569 6.69152 14.2067 6.61861 14.1433 6.5572C14.0799 6.49579 14.0047 6.44709 13.9219 6.41387C13.8391 6.38065 13.7504 6.36357 13.6608 6.36361C13.6484 6.36361 13.6366 6.36648 13.6242 6.36726H10.9526C10.9129 6.30558 10.8643 6.24966 10.8084 6.20116L8.15081 1.73835L8.14409 1.74226C7.87779 1.28516 7.37801 0.976685 6.80452 0.976685C5.95156 0.976685 5.25999 1.65673 5.25999 2.49558H5.24439V6.367H1.56355V6.37169C1.3871 6.37642 1.21945 6.44739 1.09595 6.56964C0.972448 6.69189 0.902754 6.85586 0.901566 7.02697H0.899414V14.3677H0.901028C0.901028 14.4519 0.934383 14.5362 1.00002 14.6008L0.999209 14.6016L3.62561 17.1476L3.63207 17.1414C3.70766 17.2016 3.80046 17.2243 3.89218 17.2123H13.6035C13.6231 17.2139 13.6419 17.218 13.6619 17.218C13.8363 17.2178 14.0041 17.1525 14.1304 17.0358C14.2567 16.9191 14.3319 16.7599 14.3405 16.5909H14.3427V16.5706C14.3427 16.5659 14.344 16.5614 14.344 16.5568C14.344 16.5521 14.3432 16.5476 14.3429 16.5429ZM1.7045 14.3677L1.7158 14.38L1.70315 14.3677H1.7045Z" fill="#28315F"/>
                                                           </svg>
                                                        </div>
                                                     </label>
                                                  </div>
                                                  <div class="px-2 result<?=$result['ID']?>">
                                                     <input class="hidden" type="radio" id="contactChoice2" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="decline">
                                                     <label for="contactChoice2" class="mx-3 my-4 cursor-pointer acceptions" title="отклонить">
                                                        <div class="flex items-center ">
                                                           <svg width="19" height="17" viewBox="0 0 19 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                              <path d="M0.682781 1.89876C0.682781 1.93005 0.687891 1.95978 0.692195 1.99002L0.692194 9.01057L0.692463 9.01057L0.692194 9.01292C0.692194 9.09978 0.709848 9.18579 0.744146 9.26604C0.778444 9.34629 0.828716 9.4192 0.892089 9.4806C0.955461 9.54201 1.03069 9.59072 1.11349 9.62393C1.19628 9.65715 1.28501 9.67423 1.37462 9.67419C1.38726 9.67419 1.39883 9.67133 1.4112 9.67054L2.70208 9.67054L2.70208 9.66585C2.87852 9.66112 3.04617 9.59015 3.16968 9.4679C3.29318 9.34565 3.36287 9.18168 3.36406 9.01057L3.36621 9.01057L3.36621 1.83931L3.35465 1.83931C3.3393 1.67998 3.26457 1.53153 3.14445 1.42176C3.02434 1.31199 2.86706 1.24842 2.70208 1.24296L2.70208 1.23723L1.36494 1.23723C0.988351 1.23723 0.682781 1.53344 0.682781 1.89876Z" fill="#28315F"/>
                                                              <path d="M4.71664 0.798007L4.71664 10.3137L4.71637 10.3161C4.71637 10.4029 4.73403 10.4889 4.76832 10.5692C4.80262 10.6494 4.85289 10.7223 4.91626 10.7837C4.97964 10.8452 5.05487 10.8939 5.13766 10.9271C5.22046 10.9603 5.30919 10.9774 5.39879 10.9773C5.41117 10.9773 5.423 10.9745 5.43538 10.9737L8.10697 10.9737C8.14672 11.0354 8.19526 11.0913 8.25115 11.1398L10.9088 15.6026L10.9155 15.5987C11.1818 16.0558 11.6816 16.3643 12.255 16.3643C13.108 16.3643 13.7996 15.6842 13.7996 14.8454L13.8152 14.8454L13.8152 10.9739L17.496 10.9739L17.496 10.9693C17.6725 10.9645 17.8401 10.8935 17.9636 10.7713C18.0871 10.649 18.1568 10.4851 18.158 10.314L18.1602 10.314L18.1602 2.97322L18.1585 2.97322C18.1585 2.889 18.1252 2.80477 18.0596 2.74011L18.0604 2.73932L15.434 0.193319L15.4275 0.199577C15.3519 0.139343 15.2591 0.116657 15.1674 0.12865L5.45609 0.12865C5.43646 0.127086 5.41762 0.122914 5.39772 0.122914C5.22323 0.123175 5.05551 0.188395 4.92921 0.305104C4.80291 0.421811 4.72768 0.581088 4.71906 0.750028L4.71691 0.750028L4.71691 0.770366C4.71691 0.77506 4.71556 0.779492 4.71556 0.784186C4.71556 0.78888 4.71637 0.793313 4.71664 0.798007ZM17.3551 2.97322L17.3438 2.96096L17.3564 2.97322L17.3551 2.97322Z" fill="#28315F"/>
                                                           </svg>
                                                        </div>
                                                     </label>
                                                  </div>
                                               </div>
                                            <?}elseif($result['STATUS'] === 'Согласовано'){?>
                                               <div class="flex justify-center items-center">
                                                  <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                     <rect width="37" height="30" rx="6" fill="#91B23B"/>
                                                     <path d="M24.1394 19.1181C24.1394 19.0978 24.1362 19.0785 24.1335 19.0589V14.5025H24.1333L24.1335 14.5009C24.1335 14.4446 24.1224 14.3888 24.1008 14.3367C24.0792 14.2846 24.0476 14.2373 24.0077 14.1974C23.9679 14.1576 23.9205 14.126 23.8684 14.1044C23.8164 14.0828 23.7605 14.0718 23.7042 14.0718C23.6962 14.0718 23.6889 14.0736 23.6811 14.0741H22.869V14.0772C22.758 14.0803 22.6525 14.1263 22.5748 14.2057C22.4971 14.285 22.4533 14.3914 22.4525 14.5025H22.4512V19.1567H22.4584C22.4681 19.2601 22.5151 19.3564 22.5907 19.4277C22.6663 19.4989 22.7652 19.5402 22.869 19.5437V19.5474H23.7103C23.9472 19.5474 24.1394 19.3552 24.1394 19.1181Z" fill="white"/>
                                                     <path d="M21.6014 19.8323V13.6566L21.6016 13.6551C21.6016 13.5987 21.5905 13.5429 21.5689 13.4908C21.5473 13.4387 21.5157 13.3914 21.4758 13.3515C21.4359 13.3117 21.3886 13.2801 21.3365 13.2585C21.2844 13.2369 21.2286 13.2259 21.1722 13.2259C21.1644 13.2259 21.157 13.2277 21.1492 13.2283H19.4684C19.4434 13.1882 19.4129 13.1519 19.3777 13.1205L17.7057 10.2241L17.7015 10.2266C17.5339 9.92994 17.2195 9.72974 16.8587 9.72974C16.3221 9.72974 15.887 10.1711 15.887 10.7155H15.8771V13.2281H13.5614V13.2311C13.4504 13.2342 13.3449 13.2803 13.2672 13.3596C13.1895 13.4389 13.1457 13.5454 13.1449 13.6564H13.1436V18.4206H13.1446C13.1446 18.4753 13.1656 18.5299 13.2068 18.5719L13.2063 18.5724L14.8587 20.2248L14.8628 20.2207C14.9103 20.2598 14.9687 20.2745 15.0264 20.2668H21.1362C21.1485 20.2678 21.1604 20.2705 21.1729 20.2705C21.2827 20.2703 21.3882 20.228 21.4677 20.1522C21.5471 20.0765 21.5944 19.9731 21.5999 19.8635H21.6012V19.8503C21.6012 19.8472 21.6021 19.8444 21.6021 19.8413C21.6021 19.8383 21.6016 19.8354 21.6014 19.8323ZM13.6501 18.4206L13.6572 18.4286L13.6492 18.4206H13.6501Z" fill="white"/>
                                                  </svg>
                                               </div>
                                            <?}elseif($result['STATUS'] === 'Отказано'){?>
                                               <div class="flex justify-center items-center">
                                                  <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                     <rect width="37" height="30" rx="6" fill="#EA4335"/>
                                                     <path d="M13.1399 11.8819C13.1399 11.9022 13.1431 11.9215 13.1458 11.9411L13.1458 16.4975L13.146 16.4975L13.1458 16.4991C13.1458 16.5554 13.1569 16.6112 13.1785 16.6633C13.2001 16.7154 13.2317 16.7627 13.2716 16.8026C13.3114 16.8424 13.3588 16.874 13.4108 16.8956C13.4629 16.9172 13.5188 16.9282 13.5751 16.9282C13.5831 16.9282 13.5904 16.9264 13.5982 16.9259L14.4103 16.9259L14.4103 16.9228C14.5213 16.9197 14.6268 16.8737 14.7045 16.7943C14.7822 16.715 14.826 16.6086 14.8268 16.4975L14.8281 16.4975L14.8281 11.8433L14.8208 11.8433C14.8112 11.7399 14.7642 11.6436 14.6886 11.5723C14.613 11.5011 14.5141 11.4598 14.4103 11.4563L14.4103 11.4526L13.569 11.4526C13.3321 11.4526 13.1399 11.6448 13.1399 11.8819Z" fill="white"/>
                                                     <path d="M15.6779 11.1677L15.6779 17.3434L15.6777 17.3449C15.6777 17.4013 15.6888 17.4571 15.7104 17.5092C15.732 17.5613 15.7636 17.6086 15.8035 17.6485C15.8434 17.6883 15.8907 17.7199 15.9428 17.7415C15.9949 17.7631 16.0507 17.7741 16.1071 17.7741C16.1149 17.7741 16.1223 17.7723 16.1301 17.7717L17.8109 17.7717C17.8359 17.8118 17.8664 17.8481 17.9016 17.8795L19.5736 20.7759L19.5778 20.7734C19.7454 21.0701 20.0598 21.2703 20.4206 21.2703C20.9572 21.2703 21.3923 20.8289 21.3923 20.2845L21.4021 20.2845L21.4021 17.7719L23.7179 17.7719L23.7179 17.7689C23.8289 17.7658 23.9344 17.7197 24.0121 17.6404C24.0898 17.5611 24.1336 17.4546 24.1344 17.3436L24.1357 17.3436L24.1357 12.5794L24.1347 12.5794C24.1347 12.5247 24.1137 12.4701 24.0725 12.4281L24.073 12.4276L22.4206 10.7752L22.4165 10.7793C22.369 10.7402 22.3106 10.7255 22.2529 10.7332L16.1431 10.7332C16.1308 10.7322 16.1189 10.7295 16.1064 10.7295C15.9966 10.7297 15.8911 10.772 15.8116 10.8478C15.7322 10.9235 15.6848 11.0269 15.6794 11.1365L15.6781 11.1365L15.6781 11.1497C15.6781 11.1528 15.6772 11.1556 15.6772 11.1587C15.6772 11.1617 15.6777 11.1646 15.6779 11.1677ZM23.6292 12.5794L23.6221 12.5714L23.6301 12.5794L23.6292 12.5794Z" fill="white"/>
                                                  </svg>
                                               </div>
                                           <?}?>
                                        </div>
                                        <div class="text-gray-1000 flex items-center">
                                            <?if(!$result['RESULT'] && $result['STATUS'] === NULL){?>
                                               <div class="flex items-center cursor-pointer">
                                                  <textarea class="rounded-my border border-gray-1000 resize-none py-4 px-4 outline-none text-gray-1000" cols="30" rows="2" placeholder="Введите комментарий..." data-id="<?=$result['ID']?>"></textarea>
                                               </div>
                                            <?}else{echo $result['RESULT'];}?>
                                        </div>
                                        <div class="text-gray-1000 flex items-center">-</div>
                                        <div class="flex items-center">
                                           <?=$result['DATE']?:'-'?>
                                        </div>
                                     </div>
                                  </div>
                                  <hr class="my-4">
                               <?endforeach;?>

                               <?if($request['STATUS_CLEAN'] !== 'Завершено'){?>
                                  <div class="my-2 accordeon-container flex justify-end">
                                     <div class="flex justify-center items-center">
                                        <div class="mx-4">
                                           <button class="flex items-center py-2 px-2 text-blue-1000 bg-gray-1000 font-semibold rounded-2xl cursor-pointer " data-id="<?=$headRequestIDUnder?>" data-action="sendToBack" onclick="sendUnderCommiteeHeadresult(this)">Отправить на БЭК</button>
                                        </div>
                                        <div class="mx-4">
                                           <button class="flex items-center py-2 px-2 text-white bg-green-1000 font-semibold rounded-2xl cursor-pointer " data-id="<?=$headRequestIDUnder?>" data-action="accept" onclick="sendUnderCommiteeHeadresult(this)">Согласовать</button>
                                        </div>
                                        <div class="mx-4">
                                           <button class="flex items-center py-2 px-2 text-white bg-color-red-1000 font-semibold rounded-2xl cursor-pointer" data-id="<?=$headRequestIDUnder?>" data-action="decline" onclick="sendUnderCommiteeHeadresult(this)">Отказать</button>
                                        </div>
                                     </div>
                                  </div>
                               <?}?>
                           </div>
                           <!-- тело аккордеона -->
                        </div>
                     <?endforeach;?>
                     <?if(count($arResult['requests']['underwriting']) === 0 ){?>
                        <div class="flex justify-center items-center  mt-4 bg-white info-row">Заявок нет</div>
                     <?}?>
                 </div>
                 <div x-show="back">
                    <div class="grid grid-cols-8">
                       <div class="text-gray-1000">Статус заявки</div>
                       <div class="text-gray-1000">Время и дата создания</div>
                       <div class="text-gray-1000">Менеджер</div>
                       <div class="text-gray-1000">Лизингополучатель</div>
                       <div class="text-gray-1000">Предмет лизинга</div>
                       <div class="text-gray-1000">Итоговый ИЛ</div>
                       <div class="text-gray-1000">Ссылка</div>
                       <div></div>
                    </div>
                     <?foreach ($arResult['requests']['back'] as $request):?>
                        <div class="back-request-parent-container parent-request-container" data-request-id="<?=$request['ID']?>">
                           <!-- шапка заявки -->
                           <div class="grid grid-cols-8 mt-4 bg-white info-row" :class="requestServices<?=$request['ID']?>?'accordeon-active':''">
                              <div class="flex items-center"><?=$request['STATUS']?></div>
                              <div class="flex items-center"><?=$request['BACK_TIME']?></div>
                              <div class="flex items-center"><?=$request['MANAGER']?></div>
                              <div class="flex items-center"><?=$request['LISING_OWNER']?></div>
                              <div class="flex items-center mr-4"><?=$request['LISING_GOAL']?></div>
                              <div class="flex items-center justify-center">
                                 <button class="w-8 h-8 shadow-my flex justify-center items-center rounded" data-id="<?=$request['ID']?>" onclick="managerListPopup(this)">
                                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                       <path d="M6.53596 10.5265C6.5969 10.5875 6.66925 10.6358 6.74887 10.6688C6.82849 10.7018 6.91383 10.7187 7.00001 10.7187C7.08619 10.7187 7.17153 10.7018 7.25116 10.6688C7.33078 10.6358 7.40312 10.5875 7.46406 10.5265L9.93892 8.05167C10.062 7.9286 10.1311 7.76168 10.1311 7.58763C10.1311 7.41358 10.062 7.24666 9.93892 7.12359C9.81585 7.00052 9.64893 6.93138 9.47488 6.93138C9.30083 6.93138 9.13391 7.00052 9.01084 7.12359L7.65626 8.47818V1.3125C7.65626 1.13845 7.58712 0.971532 7.46405 0.848461C7.34098 0.72539 7.17406 0.65625 7.00001 0.65625C6.82596 0.65625 6.65904 0.72539 6.53597 0.848461C6.4129 0.971532 6.34376 1.13845 6.34376 1.3125V8.47818L4.98918 7.12359C4.86611 7.00052 4.69919 6.93138 4.52514 6.93138C4.3511 6.93138 4.18418 7.00052 4.06111 7.12359C3.93804 7.24666 3.8689 7.41358 3.8689 7.58763C3.8689 7.76168 3.93804 7.9286 4.06111 8.05167L6.53596 10.5265Z" fill="#28315F"/>
                                       <path d="M12.6875 6.34375C12.5135 6.34375 12.3465 6.41289 12.2235 6.53596C12.1004 6.65903 12.0312 6.82595 12.0312 7V12.0312H1.96875V7C1.96875 6.82595 1.89961 6.65903 1.77654 6.53596C1.65347 6.41289 1.48655 6.34375 1.3125 6.34375C1.13845 6.34375 0.971532 6.41289 0.848461 6.53596C0.72539 6.65903 0.65625 6.82595 0.65625 7V12.25C0.65625 12.5401 0.771484 12.8183 0.976602 13.0234C1.18172 13.2285 1.45992 13.3438 1.75 13.3438H12.25C12.5401 13.3438 12.8183 13.2285 13.0234 13.0234C13.2285 12.8183 13.3438 12.5401 13.3438 12.25V7C13.3438 6.82595 13.2746 6.65903 13.1515 6.53596C13.0285 6.41289 12.8615 6.34375 12.6875 6.34375Z" fill="#28315F"/>
                                    </svg>
                                 </button>
                              </div>
                              <div class="flex items-center">
                                 <button class="w-8 h-8 shadow-my flex justify-center items-center rounded" onclick="copyToClipboard('<?=$request['LINK']?>')">
                                    <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                       <path d="M5.46001 4.56631V4.61631H5.51001H6.49345H6.54345V4.56631V2.03777C6.54345 2.01362 6.56318 1.99388 6.58733 1.99388H14.9227C14.9468 1.99388 14.9666 2.01362 14.9666 2.03777V10.3731C14.9666 10.3973 14.9468 10.417 14.9227 10.417H12.473H12.423V10.467V11.4505V11.5005H12.473H14.9227C15.5443 11.5005 16.05 10.9948 16.05 10.3731V2.03777C16.05 1.41613 15.5443 0.910449 14.9227 0.910449H6.58733C5.96565 0.910449 5.46001 1.41613 5.46001 2.03777V4.56631Z" fill="#28315F" stroke="#28315F" stroke-width="0.1"/>
                                       <path d="M10.4561 14.9625V14.9642C10.4552 14.9876 10.4358 15.0064 10.4122 15.0064H2.07687C2.05267 15.0064 2.03295 14.9867 2.03295 14.9625V6.62716C2.03295 6.60298 2.05269 6.58324 2.07687 6.58324H10.4122C10.4364 6.58324 10.4561 6.60298 10.4561 6.62716V14.9625ZM10.4122 5.4998H2.07687C1.45519 5.4998 0.949512 6.00548 0.949512 6.62716V14.9625C0.949546 15.5842 1.45519 16.0898 2.07687 16.0898H10.4122C11.0339 16.0898 11.5396 15.5842 11.5396 14.9625V6.62716C11.5396 6.00548 11.0338 5.4998 10.4122 5.4998Z" fill="#28315F" stroke="#28315F" stroke-width="0.1"/>
                                    </svg>
                                 </button>
                              </div>
                              <div class="flex items-center">
                                 <div class="cursor-pointer" @click="requestServices<?=$request['ID']?>=!requestServices<?=$request['ID']?>">
                                    <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                    <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                    <div class="bg-color-1000 h-0.5 w-5 my-1 rounded"></div>
                                 </div>
                              </div>
                           </div>
                           <!-- шапка заявки -->
                           <!-- тело аккордеона -->
                           <div class="w-full bg-white py-4 accordeon-row px-4 border-t border-gray-1000" x-show="requestServices<?=$request['ID']?>">
                              <div class="w-full block mb-4">
                                 <div class="grid grid-cols-5 w-full">
                                    <div class="text-gray-1000">Согласующий</div>
                                    <div class="text-gray-1000">Статус рассмотрения</div>
                                    <div class="text-gray-1000">Заключение</div>
                                    <div class="text-gray-1000">Действие</div>
                                    <div class="text-gray-1000">Дата и время принятия решения</div>
                                 </div>
                              </div>
                               <?if(count($request['UNDERWRITING_RESULTS']) > 0){?>

                                  <div class="my-8 font-bold text-xl">Решения комитета Андеррайтинг</div>
                                  <?
                                   foreach ($request['UNDERWRITING_RESULTS'] as $result):
                                     if($result['HEAD'] === 'YES') {
                                     $headRequestIDUnder = $result['ID'];
                                     }
                                  ?>
                                  <div class="my-2 accordeon-container" data-id="<?=$request['ID']?>">
                                     <div class="grid grid-cols-5 w-full">
                                        <div class="flex items-center">
                                           <div class="flex justify-start items-center">
                                              <div class="pr-2">
                                                 <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="16" cy="16" r="16" fill="#28315F"/>
                                                    <g clip-path="url(#clip0)">
                                                       <path d="M15.8975 15.7366C16.8504 15.7366 17.6756 15.3948 18.3498 14.7204C19.0241 14.0462 19.3658 13.2213 19.3658 12.2682C19.3658 11.3155 19.0241 10.4904 18.3497 9.81595C17.6754 9.14183 16.8503 8.80005 15.8975 8.80005C14.9444 8.80005 14.1194 9.14183 13.4452 9.81606C12.771 10.4903 12.4291 11.3154 12.4291 12.2682C12.4291 13.2213 12.771 14.0463 13.4453 14.7206C14.1197 15.3947 14.9447 15.7366 15.8975 15.7366Z" fill="white"/>
                                                       <path d="M21.9662 19.8728C21.9468 19.5923 21.9074 19.2862 21.8495 18.963C21.7911 18.6373 21.7158 18.3295 21.6257 18.0481C21.5327 17.7573 21.4061 17.4701 21.2497 17.1949C21.0873 16.9093 20.8966 16.6606 20.6826 16.4559C20.4588 16.2418 20.1848 16.0696 19.8679 15.944C19.5522 15.8191 19.2023 15.7558 18.828 15.7558C18.681 15.7558 18.5388 15.8162 18.2642 15.9949C18.0953 16.1051 17.8976 16.2325 17.677 16.3735C17.4884 16.4937 17.2328 16.6063 16.9172 16.7082C16.6093 16.8079 16.2966 16.8584 15.988 16.8584C15.6794 16.8584 15.3668 16.8079 15.0585 16.7082C14.7432 16.6064 14.4877 16.4938 14.2993 16.3736C14.0808 16.234 13.883 16.1065 13.7115 15.9948C13.4373 15.8161 13.295 15.7557 13.148 15.7557C12.7736 15.7557 12.4238 15.8191 12.1082 15.9442C11.7915 16.0695 11.5174 16.2417 11.2934 16.456C11.0795 16.6608 10.8887 16.9094 10.7265 17.1949C10.5702 17.4701 10.4436 17.7572 10.3505 18.0482C10.2605 18.3296 10.1852 18.6373 10.1268 18.963C10.0689 19.2857 10.0296 19.5919 10.0101 19.8732C9.99099 20.1487 9.98132 20.4347 9.98132 20.7235C9.98132 21.4752 10.2203 22.0837 10.6915 22.5325C11.1569 22.9754 11.7726 23.2 12.5215 23.2H19.4552C20.204 23.2 20.8196 22.9755 21.285 22.5325C21.7564 22.0841 21.9953 21.4754 21.9953 20.7234C21.9952 20.4333 21.9854 20.1471 21.9662 19.8728Z" fill="white"/>
                                                    </g>
                                                    <defs>
                                                       <clipPath id="clip0">
                                                          <rect width="14.4" height="14.4" fill="white" transform="translate(8.80005 8.80005)"/>
                                                       </clipPath>
                                                    </defs>
                                                 </svg>
                                              </div>
                                              <div class="px-2 text-gray-1000 sb-responsible" data-id="<?=$request['ID']?>">
                                                  <?=$result['FIO']?>
                                              </div>
                                           </div>
                                        </div>
                                        <div class="cursor-pointer status flex items-center">
                                            <?if($result['STATUS'] === 'Согласовано'){?>
                                               <div class="flex justify-center items-center">
                                                  <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                     <rect width="37" height="30" rx="6" fill="#91B23B"/>
                                                     <path d="M24.1394 19.1181C24.1394 19.0978 24.1362 19.0785 24.1335 19.0589V14.5025H24.1333L24.1335 14.5009C24.1335 14.4446 24.1224 14.3888 24.1008 14.3367C24.0792 14.2846 24.0476 14.2373 24.0077 14.1974C23.9679 14.1576 23.9205 14.126 23.8684 14.1044C23.8164 14.0828 23.7605 14.0718 23.7042 14.0718C23.6962 14.0718 23.6889 14.0736 23.6811 14.0741H22.869V14.0772C22.758 14.0803 22.6525 14.1263 22.5748 14.2057C22.4971 14.285 22.4533 14.3914 22.4525 14.5025H22.4512V19.1567H22.4584C22.4681 19.2601 22.5151 19.3564 22.5907 19.4277C22.6663 19.4989 22.7652 19.5402 22.869 19.5437V19.5474H23.7103C23.9472 19.5474 24.1394 19.3552 24.1394 19.1181Z" fill="white"/>
                                                     <path d="M21.6014 19.8323V13.6566L21.6016 13.6551C21.6016 13.5987 21.5905 13.5429 21.5689 13.4908C21.5473 13.4387 21.5157 13.3914 21.4758 13.3515C21.4359 13.3117 21.3886 13.2801 21.3365 13.2585C21.2844 13.2369 21.2286 13.2259 21.1722 13.2259C21.1644 13.2259 21.157 13.2277 21.1492 13.2283H19.4684C19.4434 13.1882 19.4129 13.1519 19.3777 13.1205L17.7057 10.2241L17.7015 10.2266C17.5339 9.92994 17.2195 9.72974 16.8587 9.72974C16.3221 9.72974 15.887 10.1711 15.887 10.7155H15.8771V13.2281H13.5614V13.2311C13.4504 13.2342 13.3449 13.2803 13.2672 13.3596C13.1895 13.4389 13.1457 13.5454 13.1449 13.6564H13.1436V18.4206H13.1446C13.1446 18.4753 13.1656 18.5299 13.2068 18.5719L13.2063 18.5724L14.8587 20.2248L14.8628 20.2207C14.9103 20.2598 14.9687 20.2745 15.0264 20.2668H21.1362C21.1485 20.2678 21.1604 20.2705 21.1729 20.2705C21.2827 20.2703 21.3882 20.228 21.4677 20.1522C21.5471 20.0765 21.5944 19.9731 21.5999 19.8635H21.6012V19.8503C21.6012 19.8472 21.6021 19.8444 21.6021 19.8413C21.6021 19.8383 21.6016 19.8354 21.6014 19.8323ZM13.6501 18.4206L13.6572 18.4286L13.6492 18.4206H13.6501Z" fill="white"/>
                                                  </svg>
                                               </div>
                                            <?}elseif($result['STATUS'] === 'Отказано'){?>
                                               <div class="flex justify-center items-center">
                                                  <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                     <rect width="37" height="30" rx="6" fill="#EA4335"/>
                                                     <path d="M13.1399 11.8819C13.1399 11.9022 13.1431 11.9215 13.1458 11.9411L13.1458 16.4975L13.146 16.4975L13.1458 16.4991C13.1458 16.5554 13.1569 16.6112 13.1785 16.6633C13.2001 16.7154 13.2317 16.7627 13.2716 16.8026C13.3114 16.8424 13.3588 16.874 13.4108 16.8956C13.4629 16.9172 13.5188 16.9282 13.5751 16.9282C13.5831 16.9282 13.5904 16.9264 13.5982 16.9259L14.4103 16.9259L14.4103 16.9228C14.5213 16.9197 14.6268 16.8737 14.7045 16.7943C14.7822 16.715 14.826 16.6086 14.8268 16.4975L14.8281 16.4975L14.8281 11.8433L14.8208 11.8433C14.8112 11.7399 14.7642 11.6436 14.6886 11.5723C14.613 11.5011 14.5141 11.4598 14.4103 11.4563L14.4103 11.4526L13.569 11.4526C13.3321 11.4526 13.1399 11.6448 13.1399 11.8819Z" fill="white"/>
                                                     <path d="M15.6779 11.1677L15.6779 17.3434L15.6777 17.3449C15.6777 17.4013 15.6888 17.4571 15.7104 17.5092C15.732 17.5613 15.7636 17.6086 15.8035 17.6485C15.8434 17.6883 15.8907 17.7199 15.9428 17.7415C15.9949 17.7631 16.0507 17.7741 16.1071 17.7741C16.1149 17.7741 16.1223 17.7723 16.1301 17.7717L17.8109 17.7717C17.8359 17.8118 17.8664 17.8481 17.9016 17.8795L19.5736 20.7759L19.5778 20.7734C19.7454 21.0701 20.0598 21.2703 20.4206 21.2703C20.9572 21.2703 21.3923 20.8289 21.3923 20.2845L21.4021 20.2845L21.4021 17.7719L23.7179 17.7719L23.7179 17.7689C23.8289 17.7658 23.9344 17.7197 24.0121 17.6404C24.0898 17.5611 24.1336 17.4546 24.1344 17.3436L24.1357 17.3436L24.1357 12.5794L24.1347 12.5794C24.1347 12.5247 24.1137 12.4701 24.0725 12.4281L24.073 12.4276L22.4206 10.7752L22.4165 10.7793C22.369 10.7402 22.3106 10.7255 22.2529 10.7332L16.1431 10.7332C16.1308 10.7322 16.1189 10.7295 16.1064 10.7295C15.9966 10.7297 15.8911 10.772 15.8116 10.8478C15.7322 10.9235 15.6848 11.0269 15.6794 11.1365L15.6781 11.1365L15.6781 11.1497C15.6781 11.1528 15.6772 11.1556 15.6772 11.1587C15.6772 11.1617 15.6777 11.1646 15.6779 11.1677ZM23.6292 12.5794L23.6221 12.5714L23.6301 12.5794L23.6292 12.5794Z" fill="white"/>
                                                  </svg>
                                               </div>
                                            <?}?>
                                        </div>
                                        <div class="text-gray-1000 flex items-center">
                                           <?=$result['RESULT']?>
                                        </div>
                                        <div class="text-gray-1000 flex items-center">
                                           <?=$result['DATE']?:'-'?>
                                        </div>
                                        <div class="flex items-center">-</div>
                                     </div>
                                  </div>
                                  <hr class="my-4">
                                   <?endforeach;?>
                                  <div class="my-8 font-bold text-xl">Решения комитета БЭК</div>
                               <?}?>
                               <?foreach ($request['BACK_RESULTS'] as $result):
                                   ?>
                                  <div class="my-2 accordeon-container" data-id="<?=$request['ID']?>">
                                     <div class="grid grid-cols-5 w-full">
                                        <div class="flex items-center">
                                           <div class="flex justify-start items-center">
                                              <div class="pr-2">
                                                 <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <circle cx="16" cy="16" r="16" fill="#28315F"/>
                                                    <g clip-path="url(#clip0)">
                                                       <path d="M15.8975 15.7366C16.8504 15.7366 17.6756 15.3948 18.3498 14.7204C19.0241 14.0462 19.3658 13.2213 19.3658 12.2682C19.3658 11.3155 19.0241 10.4904 18.3497 9.81595C17.6754 9.14183 16.8503 8.80005 15.8975 8.80005C14.9444 8.80005 14.1194 9.14183 13.4452 9.81606C12.771 10.4903 12.4291 11.3154 12.4291 12.2682C12.4291 13.2213 12.771 14.0463 13.4453 14.7206C14.1197 15.3947 14.9447 15.7366 15.8975 15.7366Z" fill="white"/>
                                                       <path d="M21.9662 19.8728C21.9468 19.5923 21.9074 19.2862 21.8495 18.963C21.7911 18.6373 21.7158 18.3295 21.6257 18.0481C21.5327 17.7573 21.4061 17.4701 21.2497 17.1949C21.0873 16.9093 20.8966 16.6606 20.6826 16.4559C20.4588 16.2418 20.1848 16.0696 19.8679 15.944C19.5522 15.8191 19.2023 15.7558 18.828 15.7558C18.681 15.7558 18.5388 15.8162 18.2642 15.9949C18.0953 16.1051 17.8976 16.2325 17.677 16.3735C17.4884 16.4937 17.2328 16.6063 16.9172 16.7082C16.6093 16.8079 16.2966 16.8584 15.988 16.8584C15.6794 16.8584 15.3668 16.8079 15.0585 16.7082C14.7432 16.6064 14.4877 16.4938 14.2993 16.3736C14.0808 16.234 13.883 16.1065 13.7115 15.9948C13.4373 15.8161 13.295 15.7557 13.148 15.7557C12.7736 15.7557 12.4238 15.8191 12.1082 15.9442C11.7915 16.0695 11.5174 16.2417 11.2934 16.456C11.0795 16.6608 10.8887 16.9094 10.7265 17.1949C10.5702 17.4701 10.4436 17.7572 10.3505 18.0482C10.2605 18.3296 10.1852 18.6373 10.1268 18.963C10.0689 19.2857 10.0296 19.5919 10.0101 19.8732C9.99099 20.1487 9.98132 20.4347 9.98132 20.7235C9.98132 21.4752 10.2203 22.0837 10.6915 22.5325C11.1569 22.9754 11.7726 23.2 12.5215 23.2H19.4552C20.204 23.2 20.8196 22.9755 21.285 22.5325C21.7564 22.0841 21.9953 21.4754 21.9953 20.7234C21.9952 20.4333 21.9854 20.1471 21.9662 19.8728Z" fill="white"/>
                                                    </g>
                                                    <defs>
                                                       <clipPath id="clip0">
                                                          <rect width="14.4" height="14.4" fill="white" transform="translate(8.80005 8.80005)"/>
                                                       </clipPath>
                                                    </defs>
                                                 </svg>
                                              </div>
                                              <div class="px-2 text-gray-1000 sb-responsible" data-id="<?=$request['ID']?>">
                                                  <?=$result['FIO']?>
                                              </div>
                                           </div>
                                        </div>
                                        <div class="cursor-pointer flex items-center status">
                                            <?if($result['STATUS'] === NULL){?>
                                               <div class="flex justify-start items-center shadow-my rounded-my">
                                                  <div class="px-2 result<?=$result['ID']?>">
                                                     <input class="hidden" type="radio" id="1contactChoice<?=$result['ID']?>" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="accept">
                                                     <label for="1contactChoice<?=$result['ID']?>" class="mx-3 my-4 cursor-pointer acceptions" title="согласовать">
                                                        <div class="flex items-center">
                                                           <svg width="19" height="18" viewBox="0 0 19 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                              <path d="M18.3763 15.4422C18.3763 15.4109 18.3712 15.3812 18.3669 15.3509V8.33037H18.3666L18.3669 8.32802C18.3669 8.24116 18.3492 8.15515 18.3149 8.0749C18.2806 7.99466 18.2304 7.92175 18.167 7.86034C18.1036 7.79893 18.0284 7.75023 17.9456 7.71701C17.8628 7.68379 17.7741 7.66671 17.6845 7.66675C17.6718 7.66675 17.6603 7.66962 17.6479 7.6704H16.357V7.67509C16.1806 7.67982 16.0129 7.75079 15.8894 7.87304C15.7659 7.99529 15.6962 8.15926 15.695 8.33037H15.6929V15.5016H15.7044C15.7198 15.661 15.7945 15.8094 15.9146 15.9192C16.0347 16.029 16.192 16.0925 16.357 16.098V16.1037H17.6941C18.0707 16.1037 18.3763 15.8075 18.3763 15.4422Z" fill="#28315F"/>
                                                              <path d="M14.3429 16.5429V7.02723L14.3432 7.02488C14.3432 6.93802 14.3255 6.85201 14.2912 6.77176C14.2569 6.69152 14.2067 6.61861 14.1433 6.5572C14.0799 6.49579 14.0047 6.44709 13.9219 6.41387C13.8391 6.38065 13.7504 6.36357 13.6608 6.36361C13.6484 6.36361 13.6366 6.36648 13.6242 6.36726H10.9526C10.9129 6.30558 10.8643 6.24966 10.8084 6.20116L8.15081 1.73835L8.14409 1.74226C7.87779 1.28516 7.37801 0.976685 6.80452 0.976685C5.95156 0.976685 5.25999 1.65673 5.25999 2.49558H5.24439V6.367H1.56355V6.37169C1.3871 6.37642 1.21945 6.44739 1.09595 6.56964C0.972448 6.69189 0.902754 6.85586 0.901566 7.02697H0.899414V14.3677H0.901028C0.901028 14.4519 0.934383 14.5362 1.00002 14.6008L0.999209 14.6016L3.62561 17.1476L3.63207 17.1414C3.70766 17.2016 3.80046 17.2243 3.89218 17.2123H13.6035C13.6231 17.2139 13.6419 17.218 13.6619 17.218C13.8363 17.2178 14.0041 17.1525 14.1304 17.0358C14.2567 16.9191 14.3319 16.7599 14.3405 16.5909H14.3427V16.5706C14.3427 16.5659 14.344 16.5614 14.344 16.5568C14.344 16.5521 14.3432 16.5476 14.3429 16.5429ZM1.7045 14.3677L1.7158 14.38L1.70315 14.3677H1.7045Z" fill="#28315F"/>
                                                           </svg>

                                                        </div>
                                                     </label>
                                                  </div>
                                                  <div class="px-2 result<?=$result['ID']?>">
                                                     <input class="hidden" type="radio" id="2contactChoice<?=$result['ID']?>" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="decline">
                                                     <label for="2contactChoice<?=$result['ID']?>" class="mx-3 my-4 cursor-pointer acceptions" title="отклонить">
                                                        <div class="flex items-center ">
                                                           <svg width="19" height="17" viewBox="0 0 19 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                              <path d="M0.682781 1.89876C0.682781 1.93005 0.687891 1.95978 0.692195 1.99002L0.692194 9.01057L0.692463 9.01057L0.692194 9.01292C0.692194 9.09978 0.709848 9.18579 0.744146 9.26604C0.778444 9.34629 0.828716 9.4192 0.892089 9.4806C0.955461 9.54201 1.03069 9.59072 1.11349 9.62393C1.19628 9.65715 1.28501 9.67423 1.37462 9.67419C1.38726 9.67419 1.39883 9.67133 1.4112 9.67054L2.70208 9.67054L2.70208 9.66585C2.87852 9.66112 3.04617 9.59015 3.16968 9.4679C3.29318 9.34565 3.36287 9.18168 3.36406 9.01057L3.36621 9.01057L3.36621 1.83931L3.35465 1.83931C3.3393 1.67998 3.26457 1.53153 3.14445 1.42176C3.02434 1.31199 2.86706 1.24842 2.70208 1.24296L2.70208 1.23723L1.36494 1.23723C0.988351 1.23723 0.682781 1.53344 0.682781 1.89876Z" fill="#28315F"/>
                                                              <path d="M4.71664 0.798007L4.71664 10.3137L4.71637 10.3161C4.71637 10.4029 4.73403 10.4889 4.76832 10.5692C4.80262 10.6494 4.85289 10.7223 4.91626 10.7837C4.97964 10.8452 5.05487 10.8939 5.13766 10.9271C5.22046 10.9603 5.30919 10.9774 5.39879 10.9773C5.41117 10.9773 5.423 10.9745 5.43538 10.9737L8.10697 10.9737C8.14672 11.0354 8.19526 11.0913 8.25115 11.1398L10.9088 15.6026L10.9155 15.5987C11.1818 16.0558 11.6816 16.3643 12.255 16.3643C13.108 16.3643 13.7996 15.6842 13.7996 14.8454L13.8152 14.8454L13.8152 10.9739L17.496 10.9739L17.496 10.9693C17.6725 10.9645 17.8401 10.8935 17.9636 10.7713C18.0871 10.649 18.1568 10.4851 18.158 10.314L18.1602 10.314L18.1602 2.97322L18.1585 2.97322C18.1585 2.889 18.1252 2.80477 18.0596 2.74011L18.0604 2.73932L15.434 0.193319L15.4275 0.199577C15.3519 0.139343 15.2591 0.116657 15.1674 0.12865L5.45609 0.12865C5.43646 0.127086 5.41762 0.122914 5.39772 0.122914C5.22323 0.123175 5.05551 0.188395 4.92921 0.305104C4.80291 0.421811 4.72768 0.581088 4.71906 0.750028L4.71691 0.750028L4.71691 0.770366C4.71691 0.77506 4.71556 0.779492 4.71556 0.784186C4.71556 0.78888 4.71637 0.793313 4.71664 0.798007ZM17.3551 2.97322L17.3438 2.96096L17.3564 2.97322L17.3551 2.97322Z" fill="#28315F"/>
                                                           </svg>
                                                        </div>
                                                     </label>
                                                  </div>
                                                  <div class="px-2 result<?=$result['ID']?>">
                                                     <input class="hidden" type="radio" id="3contactChoice<?=$result['ID']?>" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="ignore">
                                                     <label for="3contactChoice<?=$result['ID']?>" class="mx-3 my-4 cursor-pointer acceptions" title="воздержаться">
                                                        <div class="flex items-center">
                                                           <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                              <g clip-path="url(#clip0)">
                                                                 <path d="M16.6033 5.78419C17.2111 5.78419 17.7037 5.30661 17.7037 4.71748C17.7037 4.12834 17.2111 3.65076 16.6033 3.65076C15.9956 3.65076 15.5029 4.12834 15.5029 4.71748C15.5029 5.30661 15.9956 5.78419 16.6033 5.78419Z" fill="#28315F"/>
                                                                 <path d="M13.6688 3.65077C14.2765 3.65077 14.7692 3.17319 14.7692 2.58405C14.7692 1.99492 14.2765 1.51733 13.6688 1.51733C13.061 1.51733 12.5684 1.99492 12.5684 2.58405C12.5684 3.17319 13.061 3.65077 13.6688 3.65077Z" fill="#28315F"/>
                                                                 <path d="M10.7347 2.93959C11.3424 2.93959 11.8351 2.462 11.8351 1.87287C11.8351 1.28374 11.3424 0.806152 10.7347 0.806152C10.1269 0.806152 9.63428 1.28374 9.63428 1.87287C9.63428 2.462 10.1269 2.93959 10.7347 2.93959Z" fill="#28315F"/>
                                                                 <path d="M7.80011 4.36195C8.40785 4.36195 8.90052 3.88437 8.90052 3.29523C8.90052 2.7061 8.40785 2.22852 7.80011 2.22852C7.19237 2.22852 6.69971 2.7061 6.69971 3.29523C6.69971 3.88437 7.19237 4.36195 7.80011 4.36195Z" fill="#28315F"/>
                                                                 <path d="M15.5029 4.71739V9.33983C15.5029 9.53611 15.3386 9.69541 15.1361 9.69541C14.9336 9.69541 14.7693 9.53611 14.7693 9.33983V2.58395H12.5685V8.62869C12.5685 8.82496 12.4041 8.98426 12.2017 8.98426C11.9992 8.98426 11.8349 8.82496 11.8349 8.62869V1.8728H9.63406V8.62869C9.63406 8.82496 9.46973 8.98426 9.26726 8.98426C9.06479 8.98426 8.90046 8.82496 8.90046 8.62869V3.29509H6.69965V12.1844L5.2141 10.2138C4.77394 9.55602 3.91489 9.33557 3.28546 9.71247C2.65823 10.0979 2.5027 10.9385 2.937 11.5942C2.937 11.5942 5.33295 15.1094 6.35412 16.6141C7.3753 18.1189 9.02957 19.2959 12.1232 19.2959C17.2452 19.2959 17.7037 15.4614 17.7037 14.3179C17.7037 13.1743 17.7037 4.71739 17.7037 4.71739H15.5029Z" fill="#28315F"/>
                                                              </g>
                                                              <defs>
                                                                 <clipPath id="clip0">
                                                                    <rect width="19.0737" height="18.4898" fill="white" transform="translate(0.660645 0.806152)"/>
                                                                 </clipPath>
                                                              </defs>
                                                           </svg>
                                                        </div>
                                                     </label>
                                                  </div>
                                                  <div class="px-2 result<?=$result['ID']?>">
                                                     <input class="hidden" type="radio" id="4contactChoice<?=$result['ID']?>" name="result<?=$result['ID']?>" data-id="<?=$result['ID']?>" value="edit">
                                                     <label for="4contactChoice<?=$result['ID']?>" class="mx-3 my-4 cursor-pointer acceptions" title="доработать">
                                                        <div class="flex items-center">
                                                           <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                              <g clip-path="url(#clip0)">
                                                                 <path d="M10.837 3.65295L1.21694 12.9792C1.16854 13.0262 1.13359 13.0857 1.11695 13.1495L0.0506573 17.2984C0.0187615 17.4233 0.0566205 17.5561 0.150644 17.6472C0.221785 17.7162 0.318721 17.7544 0.417875 17.7544C0.448246 17.7544 0.47931 17.7507 0.509541 17.7433L4.78941 16.7096C4.85611 16.6934 4.91671 16.6597 4.96511 16.6128L14.586 7.2872L10.837 3.65295Z" fill="#28315F"/>
                                                                 <path d="M16.9693 2.3818L15.8984 1.34371C15.1827 0.649905 13.9353 0.650577 13.2204 1.34371L11.9087 2.61531L15.6575 6.24941L16.9693 4.97782C17.3268 4.63139 17.5237 4.17028 17.5237 3.67987C17.5237 3.18947 17.3268 2.72836 16.9693 2.3818Z" fill="#28315F"/>
                                                              </g>
                                                              <defs>
                                                                 <clipPath id="clip0">
                                                                    <rect width="17.4842" height="16.949" fill="white" transform="translate(0.0395508 0.806152)"/>
                                                                 </clipPath>
                                                              </defs>
                                                           </svg>

                                                        </div>
                                                     </label>
                                                  </div>

                                               </div>

                                            <?}elseif($result['STATUS'] === 'Согласовано'){?>
                                               <div class="flex justify-center items-center">
                                                  <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                     <rect width="37" height="30" rx="6" fill="#91B23B"/>
                                                     <path d="M24.1394 19.1181C24.1394 19.0978 24.1362 19.0785 24.1335 19.0589V14.5025H24.1333L24.1335 14.5009C24.1335 14.4446 24.1224 14.3888 24.1008 14.3367C24.0792 14.2846 24.0476 14.2373 24.0077 14.1974C23.9679 14.1576 23.9205 14.126 23.8684 14.1044C23.8164 14.0828 23.7605 14.0718 23.7042 14.0718C23.6962 14.0718 23.6889 14.0736 23.6811 14.0741H22.869V14.0772C22.758 14.0803 22.6525 14.1263 22.5748 14.2057C22.4971 14.285 22.4533 14.3914 22.4525 14.5025H22.4512V19.1567H22.4584C22.4681 19.2601 22.5151 19.3564 22.5907 19.4277C22.6663 19.4989 22.7652 19.5402 22.869 19.5437V19.5474H23.7103C23.9472 19.5474 24.1394 19.3552 24.1394 19.1181Z" fill="white"/>
                                                     <path d="M21.6014 19.8323V13.6566L21.6016 13.6551C21.6016 13.5987 21.5905 13.5429 21.5689 13.4908C21.5473 13.4387 21.5157 13.3914 21.4758 13.3515C21.4359 13.3117 21.3886 13.2801 21.3365 13.2585C21.2844 13.2369 21.2286 13.2259 21.1722 13.2259C21.1644 13.2259 21.157 13.2277 21.1492 13.2283H19.4684C19.4434 13.1882 19.4129 13.1519 19.3777 13.1205L17.7057 10.2241L17.7015 10.2266C17.5339 9.92994 17.2195 9.72974 16.8587 9.72974C16.3221 9.72974 15.887 10.1711 15.887 10.7155H15.8771V13.2281H13.5614V13.2311C13.4504 13.2342 13.3449 13.2803 13.2672 13.3596C13.1895 13.4389 13.1457 13.5454 13.1449 13.6564H13.1436V18.4206H13.1446C13.1446 18.4753 13.1656 18.5299 13.2068 18.5719L13.2063 18.5724L14.8587 20.2248L14.8628 20.2207C14.9103 20.2598 14.9687 20.2745 15.0264 20.2668H21.1362C21.1485 20.2678 21.1604 20.2705 21.1729 20.2705C21.2827 20.2703 21.3882 20.228 21.4677 20.1522C21.5471 20.0765 21.5944 19.9731 21.5999 19.8635H21.6012V19.8503C21.6012 19.8472 21.6021 19.8444 21.6021 19.8413C21.6021 19.8383 21.6016 19.8354 21.6014 19.8323ZM13.6501 18.4206L13.6572 18.4286L13.6492 18.4206H13.6501Z" fill="white"/>
                                                  </svg>
                                               </div>
                                            <?}elseif($result['STATUS'] === 'Отказано'){?>
                                               <div class="flex justify-center items-center">
                                                  <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                     <rect width="37" height="30" rx="6" fill="#EA4335"/>
                                                     <path d="M13.1399 11.8819C13.1399 11.9022 13.1431 11.9215 13.1458 11.9411L13.1458 16.4975L13.146 16.4975L13.1458 16.4991C13.1458 16.5554 13.1569 16.6112 13.1785 16.6633C13.2001 16.7154 13.2317 16.7627 13.2716 16.8026C13.3114 16.8424 13.3588 16.874 13.4108 16.8956C13.4629 16.9172 13.5188 16.9282 13.5751 16.9282C13.5831 16.9282 13.5904 16.9264 13.5982 16.9259L14.4103 16.9259L14.4103 16.9228C14.5213 16.9197 14.6268 16.8737 14.7045 16.7943C14.7822 16.715 14.826 16.6086 14.8268 16.4975L14.8281 16.4975L14.8281 11.8433L14.8208 11.8433C14.8112 11.7399 14.7642 11.6436 14.6886 11.5723C14.613 11.5011 14.5141 11.4598 14.4103 11.4563L14.4103 11.4526L13.569 11.4526C13.3321 11.4526 13.1399 11.6448 13.1399 11.8819Z" fill="white"/>
                                                     <path d="M15.6779 11.1677L15.6779 17.3434L15.6777 17.3449C15.6777 17.4013 15.6888 17.4571 15.7104 17.5092C15.732 17.5613 15.7636 17.6086 15.8035 17.6485C15.8434 17.6883 15.8907 17.7199 15.9428 17.7415C15.9949 17.7631 16.0507 17.7741 16.1071 17.7741C16.1149 17.7741 16.1223 17.7723 16.1301 17.7717L17.8109 17.7717C17.8359 17.8118 17.8664 17.8481 17.9016 17.8795L19.5736 20.7759L19.5778 20.7734C19.7454 21.0701 20.0598 21.2703 20.4206 21.2703C20.9572 21.2703 21.3923 20.8289 21.3923 20.2845L21.4021 20.2845L21.4021 17.7719L23.7179 17.7719L23.7179 17.7689C23.8289 17.7658 23.9344 17.7197 24.0121 17.6404C24.0898 17.5611 24.1336 17.4546 24.1344 17.3436L24.1357 17.3436L24.1357 12.5794L24.1347 12.5794C24.1347 12.5247 24.1137 12.4701 24.0725 12.4281L24.073 12.4276L22.4206 10.7752L22.4165 10.7793C22.369 10.7402 22.3106 10.7255 22.2529 10.7332L16.1431 10.7332C16.1308 10.7322 16.1189 10.7295 16.1064 10.7295C15.9966 10.7297 15.8911 10.772 15.8116 10.8478C15.7322 10.9235 15.6848 11.0269 15.6794 11.1365L15.6781 11.1365L15.6781 11.1497C15.6781 11.1528 15.6772 11.1556 15.6772 11.1587C15.6772 11.1617 15.6777 11.1646 15.6779 11.1677ZM23.6292 12.5794L23.6221 12.5714L23.6301 12.5794L23.6292 12.5794Z" fill="white"/>
                                                  </svg>
                                               </div>
                                            <?}elseif($result['STATUS'] === 'Воздержался'){?>
                                               <div class="flex justify-center items-center">
                                                  <svg width="37" height="30" viewBox="0 0 37 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                     <rect width="37" height="30" rx="6" fill="#FFC700"/>
                                                     <path d="M23.0302 12.2308C23.4126 12.2308 23.7225 11.9208 23.7225 11.5385C23.7225 11.1561 23.4126 10.8462 23.0302 10.8462C22.6478 10.8462 22.3379 11.1561 22.3379 11.5385C22.3379 11.9208 22.6478 12.2308 23.0302 12.2308Z" fill="white"/>
                                                     <path d="M21.1845 10.8462C21.5668 10.8462 21.8768 10.5362 21.8768 10.1539C21.8768 9.7715 21.5668 9.46155 21.1845 9.46155C20.8021 9.46155 20.4922 9.7715 20.4922 10.1539C20.4922 10.5362 20.8021 10.8462 21.1845 10.8462Z" fill="white"/>
                                                     <path d="M19.3378 10.3846C19.7202 10.3846 20.0301 10.0747 20.0301 9.69231C20.0301 9.30996 19.7202 9 19.3378 9C18.9555 9 18.6455 9.30996 18.6455 9.69231C18.6455 10.0747 18.9555 10.3846 19.3378 10.3846Z" fill="white"/>
                                                     <path d="M17.4921 11.3077C17.8745 11.3077 18.1844 10.9978 18.1844 10.6154C18.1844 10.2331 17.8745 9.9231 17.4921 9.9231C17.1098 9.9231 16.7998 10.2331 16.7998 10.6154C16.7998 10.9978 17.1098 11.3077 17.4921 11.3077Z" fill="white"/>
                                                     <path d="M22.3379 11.5384V14.5384C22.3379 14.6658 22.2345 14.7692 22.1071 14.7692C21.9797 14.7692 21.8763 14.6658 21.8763 14.5384V10.1538H20.4917V14.0769C20.4917 14.2043 20.3883 14.3076 20.2609 14.3076C20.1335 14.3076 20.0302 14.2043 20.0302 14.0769V9.69226H18.6455V14.0769C18.6455 14.2043 18.5422 14.3076 18.4148 14.3076C18.2874 14.3076 18.184 14.2043 18.184 14.0769V10.6153H16.7994V16.3846L15.8648 15.1056C15.5879 14.6787 15.0474 14.5356 14.6514 14.7803C14.2568 15.0304 14.1589 15.576 14.4322 16.0015C14.4322 16.0015 15.9395 18.2829 16.582 19.2595C17.2245 20.2361 18.2652 21 20.2115 21C23.434 21 23.7225 18.5113 23.7225 17.7692C23.7225 17.027 23.7225 11.5384 23.7225 11.5384H22.3379Z" fill="white"/>
                                                  </svg>

                                               </div>
                                            <?}elseif($result['STATUS'] === 'На доработку'){?>
                                               <div class="flex justify-center items-center">
                                                  <svg width="39" height="32" viewBox="0 0 39 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                     <rect x="1" y="1" width="37" height="30" rx="6" fill="white" stroke="#D9DCEA"/>
                                                     <g clip-path="url(#clip0)">
                                                        <path d="M21.837 10.653L12.2169 19.9792C12.1685 20.0262 12.1336 20.0857 12.1169 20.1495L11.0507 24.2984C11.0188 24.4233 11.0566 24.5561 11.1506 24.6472C11.2218 24.7162 11.3187 24.7544 11.4179 24.7544C11.4482 24.7544 11.4793 24.7507 11.5095 24.7433L15.7894 23.7096C15.8561 23.6934 15.9167 23.6597 15.9651 23.6128L25.586 14.2872L21.837 10.653Z" fill="#28315F"/>
                                                        <path d="M27.9693 9.3818L26.8984 8.34371C26.1827 7.64991 24.9353 7.65058 24.2204 8.34371L22.9087 9.61531L26.6575 13.2494L27.9693 11.9778C28.3268 11.6314 28.5237 11.1703 28.5237 10.6799C28.5237 10.1895 28.3268 9.72836 27.9693 9.3818Z" fill="#28315F"/>
                                                     </g>
                                                     <defs>
                                                        <clipPath id="clip0">
                                                           <rect width="17.4842" height="16.949" fill="white" transform="translate(11.0396 7.80615)"/>
                                                        </clipPath>
                                                     </defs>
                                                  </svg>
                                               </div>
                                            <?}?>
                                        </div>
                                        <div class="text-gray-1000 flex items-center conclusion">
                                            <?if(!$result['RESULT'] && $result['STATUS'] === NULL){?>
                                               <div class="flex items-center cursor-pointer">
                                                  <textarea class="rounded-my border border-gray-1000 resize-none py-4 px-4 outline-none text-gray-1000" cols="30" rows="2" placeholder="Введите комментарий..." data-id="<?=$result['ID']?>"></textarea>
<!--                                                  <div class="ml-4">-->
<!--                                                     <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">-->
<!--                                                        <path d="M11 0C4.91979 0 0 4.92022 0 11C0 17.0802 4.92022 22 11 22C17.0802 22 22 17.0798 22 11C22 4.91979 17.0798 0 11 0ZM11 20.2812C5.86983 20.2812 1.71875 16.1298 1.71875 11C1.71875 5.86983 5.87018 1.71875 11 1.71875C16.1302 1.71875 20.2812 5.87018 20.2812 11C20.2812 16.1302 16.1298 20.2812 11 20.2812Z" fill="#28315F"/>-->
<!--                                                        <path d="M11 5.53772C10.5254 5.53772 10.1406 5.92246 10.1406 6.39709V11.9312C10.1406 12.4058 10.5254 12.7905 11 12.7905C11.4746 12.7905 11.8594 12.4058 11.8594 11.9312V6.39709C11.8594 5.92246 11.4746 5.53772 11 5.53772Z" fill="#28315F"/>-->
<!--                                                        <path d="M11 16.1631C11.6407 16.1631 12.1602 15.6437 12.1602 15.0029C12.1602 14.3622 11.6407 13.8428 11 13.8428C10.3593 13.8428 9.83984 14.3622 9.83984 15.0029C9.83984 15.6437 10.3593 16.1631 11 16.1631Z" fill="#28315F"/>-->
<!--                                                     </svg>-->
<!--                                                  </div>-->
                                               </div>
                                            <?}else{echo $result['RESULT'];}?>
                                        </div>
                                        <div class="text-gray-1000 flex items-center dejstvije">
                                            <?if($result['STATUS'] === NULL){?>
                                               <button class="flex items-center py-2 px-2 text-white bg-green-1000 font-semibold rounded-2xl cursor-pointer" onclick="sendCommiteeBackResult(this)" data-id="<?=$result['ID']?>">Отправить решение</button>
                                            <?}else {echo '-';}?>
                                        </div>
                                        <div class="text-gray-1000 flex justify-center items-center conclusion-time">
                                            <?=$result['DATE']?$result['DATE']:'-';?>
                                        </div>
                                     </div>
                                  </div>
                                  <hr class="my-4">
                               <?endforeach;?>
                           </div>
                           <!-- тело аккордеона -->
                        </div>
                     <?endforeach;?>
                    <!-- Если заявок нет -->
                     <?if(count($arResult['requests']['back']) === 0 ){?>
                        <div class="flex justify-center items-center mt-4 bg-white info-row">Заявок нет</div>
                     <?}?>
                    <!-- Если заявок нет -->
                 </div>

              </div>
           </div>
        </div>
    </div>
</div>
<!--Modal perms-->
<div class="modal perms-modal opacity-0 pointer-events-none fixed w-full h-full top-0 left-0 flex items-center justify-center z-9998">
   <div class="modal-overlay absolute w-full h-full bg-gray-900 opacity-50"></div>
   <div class="modal-container bg-white w-11/12 md:max-w-4xl mx-auto rounded shadow-lg z-50 overflow-y-auto">
      <div class="modal-close absolute top-0 right-0 cursor-pointer flex flex-col items-center mt-4 mr-4 text-white text-sm z-50">
         <svg class="fill-current text-white" xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18">
            <path d="M14.53 4.53l-1.06-1.06L9 7.94 4.53 3.47 3.47 4.53 7.94 9l-4.47 4.47 1.06 1.06L9 10.06l4.47 4.47 1.06-1.06L10.06 9z"></path>
         </svg>
         <span class="text-sm">(Esc)</span>
      </div>

      <!-- Add margin if you want to see some of the overlay behind the modal-->
      <div class="modal-content py-4 text-left px-6">
         <div class="flex justify-end items-center pb-3">
            <div class="modal-close cursor-pointer z-50">
               <svg class="fill-current text-black" xmlns="http://www.w3.org/2000/svg" width="18" height="18" viewBox="0 0 18 18">
                  <path d="M14.53 4.53l-1.06-1.06L9 7.94 4.53 3.47 3.47 4.53 7.94 9l-4.47 4.47 1.06 1.06L9 10.06l4.47 4.47 1.06-1.06L10.06 9z"></path>
               </svg>
            </div>
         </div>
         <div class="flex justify-center text-blue-1000 font-semibold text-2xl mb-4 modal-title">
            Настройка прав доступа
         </div>
         <div class="modal-body">
            <div class="flex justify-start items-start my-2">
               <div class="mx-4 w-48 text-gray-1000">
                  Роль
               </div>
               <div class="text-gray-1000">
                  Сотрудники
               </div>
            </div>
            <div class="permission-container">
                <?if(count($arResult['PERMISSIONS_LIST']) > 0){
                    foreach ($arResult['PERMISSIONS_LIST'] as $permissionId => $permission):?>
                       <div class="flex justify-between items-center role-container">
                          <div class="mx-2 w-48 px-6 text-blue-1000 border-r-2">
                              <?=$permission['TITLE']?>
                          </div>
                          <div class="mx-6 text-blue-1000"><?=$permission['USERS']?></div>
                          <div class="flex mx-4">
                             <div class="mx-2 flex justify-center items-center w-8 h-8 shadow-my rounded cursor-pointer edit-permission" onclick="editPermission(<?=$permissionId?>)">
                                <div>
                                   <svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                      <path d="M7.41065 2.0155L0.808079 8.61855C0.774861 8.65186 0.750876 8.69393 0.739454 8.73914L0.00762279 11.6766C-0.0142684 11.765 0.0117155 11.859 0.0762469 11.9235C0.125074 11.9724 0.191604 11.9994 0.259657 11.9994C0.280501 11.9994 0.301821 11.9968 0.32257 11.9916L3.25999 11.2597C3.30577 11.2483 3.34736 11.2244 3.38058 11.1911L9.98372 4.58857L7.41065 2.0155Z" fill="#28315F"/>
                                      <path d="M11.6195 1.11523L10.8845 0.38026C10.3933 -0.110959 9.53718 -0.110483 9.04653 0.38026L8.14624 1.28056L10.7192 3.85353L11.6195 2.95323C11.8649 2.70796 12 2.38149 12 2.03428C12 1.68707 11.8649 1.3606 11.6195 1.11523Z" fill="#28315F"/>
                                   </svg>
                                </div>
                             </div>
                             <div class="mx-2">
                                <div class="mx-2 flex justify-center items-center w-8 h-8 shadow-my rounded cursor-pointer delete-permission" onclick="deletePermission(<?=$permissionId?>)">
                                   <div>
                                      <svg width="10" height="12" viewBox="0 0 10 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                         <path d="M8.9375 1.5H6.875V1.125C6.875 0.503672 6.37133 0 5.75 0H4.25C3.62867 0 3.125 0.503672 3.125 1.125V1.5H1.0625C0.544742 1.5 0.125 1.91974 0.125 2.4375V3.1875C0.125 3.39462 0.292883 3.5625 0.5 3.5625H9.5C9.70712 3.5625 9.875 3.39462 9.875 3.1875V2.4375C9.875 1.91974 9.45526 1.5 8.9375 1.5ZM3.875 1.125C3.875 0.918281 4.04328 0.75 4.25 0.75H5.75C5.95672 0.75 6.125 0.918281 6.125 1.125V1.5H3.875V1.125Z" fill="#EA4335"/>
                                         <path d="M0.836604 4.3125C0.76969 4.3125 0.71637 4.36842 0.719557 4.43527L1.02893 10.9284C1.05753 11.5294 1.55112 12 2.15253 12H7.84737C8.44878 12 8.94237 11.5294 8.97096 10.9284L9.28034 4.43527C9.28353 4.36842 9.23021 4.3125 9.16329 4.3125H0.836604ZM6.49995 5.25C6.49995 5.04281 6.66776 4.875 6.87495 4.875C7.08214 4.875 7.24995 5.04281 7.24995 5.25V10.125C7.24995 10.3322 7.08214 10.5 6.87495 10.5C6.66776 10.5 6.49995 10.3322 6.49995 10.125V5.25ZM4.62495 5.25C4.62495 5.04281 4.79276 4.875 4.99995 4.875C5.20714 4.875 5.37495 5.04281 5.37495 5.25V10.125C5.37495 10.3322 5.20714 10.5 4.99995 10.5C4.79276 10.5 4.62495 10.3322 4.62495 10.125V5.25ZM2.74995 5.25C2.74995 5.04281 2.91776 4.875 3.12495 4.875C3.33214 4.875 3.49995 5.04281 3.49995 5.25V10.125C3.49995 10.3322 3.33214 10.5 3.12495 10.5C2.91776 10.5 2.74995 10.3322 2.74995 10.125V5.25Z" fill="#EA4335"/>
                                      </svg>
                                   </div>
                                </div>
                             </div>
                          </div>
                       </div>
                    <?endforeach;
                }else{?>
                   <div class="flex justify-center items-center role-container">
                      Прав доступа не создано
                   </div>
                <?}?>
            </div>
            <div class="flex items-center justify-center my-4">
               <div>
                  <button class="mx-4 text-blue-1000 rounded-2xl h-9 w-52 flex justify-center items-center font-semibold px-2 bg-gray-1000" onclick="addPermission()">Добавить роль</button>
               </div>
               <div>
                  <button class="mx-4 text-blue-1000 rounded-2xl h-9 w-52 flex justify-center items-center font-semibold px-2 bg-gray-1000" onclick="toggleModal()">Отмена</button>
               </div>
               <div>
                  <button class="mx-4 text-blue-1000 border rounded-2xl h-9 w-32 flex justify-center items-center font-semibold active px-1">
                     Сохранить
                  </button>
               </div>
            </div>
         </div>
      </div>
   </div>
</div>
<!--Modal perms-->

<script>

   const picker = new Litepicker({
      element: document.querySelector('.filter-date'),
      plugins: ['ranges'],
      lang:'ru',
      format:'DD.MM.YYYY'
   });
</script>